{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 169,
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import find_dotenv, load_dotenv\n",
    "import os\n",
    "import pandas as pd\n",
    "from fuzzywuzzy import fuzz\n",
    "import configparser\n",
    "from azure.cosmos.cosmos_client import CosmosClient\n",
    "from gremlin_python.driver import client, serializer\n",
    "import requests\n",
    "import pandas as pd\n",
    "import re"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category_id</th>\n",
       "      <th>category_name</th>\n",
       "      <th>icon</th>\n",
       "      <th>link</th>\n",
       "      <th>long_description</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/athena/?c=1&amp;pt=1</td>\n",
       "      <td>Amazon Athena is an interactive query service ...</td>\n",
       "      <td>Amazon Athena</td>\n",
       "      <td>Query Data in S3 using SQL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/cloudsearch/?c=1&amp;pt=2</td>\n",
       "      <td>Related Links\\nGet Started for Free\\nAmazon Cl...</td>\n",
       "      <td>Amazon CloudSearch</td>\n",
       "      <td>Managed Search Service</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/elasticsearch-service/?...</td>\n",
       "      <td>Amazon Elasticsearch Service is a fully manage...</td>\n",
       "      <td>Amazon Elasticsearch Service</td>\n",
       "      <td>Run and Scale Elasticsearch Clusters</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/elasticmapreduce/?c=1&amp;pt=4</td>\n",
       "      <td>Amazon EMR provides a managed Hadoop framework...</td>\n",
       "      <td>Amazon EMR</td>\n",
       "      <td>Hosted Hadoop Framework</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/kinesis/?c=1&amp;pt=5</td>\n",
       "      <td>Amazon Kinesis makes it easy to collect, proce...</td>\n",
       "      <td>Amazon Kinesis</td>\n",
       "      <td>Work with Real-time Streaming Data</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   category_id category_name icon  \\\n",
       "0            1     Analytics        \n",
       "1            1     Analytics        \n",
       "2            1     Analytics        \n",
       "3            1     Analytics        \n",
       "4            1     Analytics        \n",
       "\n",
       "                                                link  \\\n",
       "0            https://aws.amazon.com/athena/?c=1&pt=1   \n",
       "1       https://aws.amazon.com/cloudsearch/?c=1&pt=2   \n",
       "2  https://aws.amazon.com/elasticsearch-service/?...   \n",
       "3  https://aws.amazon.com/elasticmapreduce/?c=1&pt=4   \n",
       "4           https://aws.amazon.com/kinesis/?c=1&pt=5   \n",
       "\n",
       "                                    long_description  \\\n",
       "0  Amazon Athena is an interactive query service ...   \n",
       "1  Related Links\\nGet Started for Free\\nAmazon Cl...   \n",
       "2  Amazon Elasticsearch Service is a fully manage...   \n",
       "3  Amazon EMR provides a managed Hadoop framework...   \n",
       "4  Amazon Kinesis makes it easy to collect, proce...   \n",
       "\n",
       "                           name                     short_description  \n",
       "0                 Amazon Athena            Query Data in S3 using SQL  \n",
       "1            Amazon CloudSearch                Managed Search Service  \n",
       "2  Amazon Elasticsearch Service  Run and Scale Elasticsearch Clusters  \n",
       "3                    Amazon EMR               Hosted Hadoop Framework  \n",
       "4                Amazon Kinesis    Work with Real-time Streaming Data  "
      ]
     },
     "execution_count": 146,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "aws_services = pd.read_csv('../data/raw/aws_services.csv')\n",
    "aws_services.fillna('', inplace=True)\n",
    "aws_services.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category_id</th>\n",
       "      <th>category_name</th>\n",
       "      <th>icon</th>\n",
       "      <th>link</th>\n",
       "      <th>long_description</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/virtual...</td>\n",
       "      <td>Provision virtual machines of Ubuntu, Red Hat,...</td>\n",
       "      <td>Azure Linux Virtual Machines</td>\n",
       "      <td>Provision virtual machines of Ubuntu, Red Hat,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/virtual...</td>\n",
       "      <td>Provision virtual machines for SQL Server, Sha...</td>\n",
       "      <td>Azure Windows Virtual Machines</td>\n",
       "      <td>Provision virtual machines for SQL Server, Sha...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/app-ser...</td>\n",
       "      <td>Quickly create powerful cloud apps for web and...</td>\n",
       "      <td>Azure App Service</td>\n",
       "      <td>Quickly create powerful cloud apps for web and...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/azure-f...</td>\n",
       "      <td>Process events with serverless code</td>\n",
       "      <td>Azure Functions</td>\n",
       "      <td>Process events with serverless code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/batch/</td>\n",
       "      <td>Cloud-scale job scheduling and compute management</td>\n",
       "      <td>Azure Batch</td>\n",
       "      <td>Cloud-scale job scheduling and compute management</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  category_id category_name  \\\n",
       "0     Compute       Compute   \n",
       "1     Compute       Compute   \n",
       "2     Compute       Compute   \n",
       "3     Compute       Compute   \n",
       "4     Compute       Compute   \n",
       "\n",
       "                                                icon  \\\n",
       "0  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "1  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "2  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "3  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "4  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "\n",
       "                                                link  \\\n",
       "0  https://docs.microsoft.com/en-us/azure/virtual...   \n",
       "1  https://docs.microsoft.com/en-us/azure/virtual...   \n",
       "2  https://docs.microsoft.com/en-us/azure/app-ser...   \n",
       "3  https://docs.microsoft.com/en-us/azure/azure-f...   \n",
       "4      https://docs.microsoft.com/en-us/azure/batch/   \n",
       "\n",
       "                                    long_description  \\\n",
       "0  Provision virtual machines of Ubuntu, Red Hat,...   \n",
       "1  Provision virtual machines for SQL Server, Sha...   \n",
       "2  Quickly create powerful cloud apps for web and...   \n",
       "3                Process events with serverless code   \n",
       "4  Cloud-scale job scheduling and compute management   \n",
       "\n",
       "                             name  \\\n",
       "0    Azure Linux Virtual Machines   \n",
       "1  Azure Windows Virtual Machines   \n",
       "2               Azure App Service   \n",
       "3                 Azure Functions   \n",
       "4                     Azure Batch   \n",
       "\n",
       "                                   short_description  \n",
       "0  Provision virtual machines of Ubuntu, Red Hat,...  \n",
       "1  Provision virtual machines for SQL Server, Sha...  \n",
       "2  Quickly create powerful cloud apps for web and...  \n",
       "3                Process events with serverless code  \n",
       "4  Cloud-scale job scheduling and compute management  "
      ]
     },
     "execution_count": 147,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "azure_services = pd.read_csv('../data/raw/azure_services.csv')\n",
    "azure_services.fillna('', inplace=True)\n",
    "azure_services.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category_name</th>\n",
       "      <th>icon</th>\n",
       "      <th>link</th>\n",
       "      <th>long_description</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/compute/</td>\n",
       "      <td>Google Compute Engine offers high performance ...</td>\n",
       "      <td>Compute Engine</td>\n",
       "      <td>Scalable, high performance VMs.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/appengine/</td>\n",
       "      <td>Google App Engine lets developers build scalab...</td>\n",
       "      <td>App Engine</td>\n",
       "      <td>Serverless application platform for apps and b...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/kubernetes-engine/</td>\n",
       "      <td>Google Kubernetes Engine is a powerful cluster...</td>\n",
       "      <td>Kubernetes Engine</td>\n",
       "      <td>Run containerized applications.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/gke-on-prem/</td>\n",
       "      <td>GKE On-Prem will provision and manage the unde...</td>\n",
       "      <td>GKE On-Prem</td>\n",
       "      <td>Make apps “cloud-ready” and move them to the c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/functions/</td>\n",
       "      <td>Google Cloud Functions makes it easy for devel...</td>\n",
       "      <td>Cloud Functions</td>\n",
       "      <td>Event-driven serverless compute platform.</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  category_name                                               icon  \\\n",
       "0       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "1       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "2       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "3       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "4       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "\n",
       "                                          link  \\\n",
       "0            https://cloud.google.com/compute/   \n",
       "1          https://cloud.google.com/appengine/   \n",
       "2  https://cloud.google.com/kubernetes-engine/   \n",
       "3        https://cloud.google.com/gke-on-prem/   \n",
       "4          https://cloud.google.com/functions/   \n",
       "\n",
       "                                    long_description               name  \\\n",
       "0  Google Compute Engine offers high performance ...     Compute Engine   \n",
       "1  Google App Engine lets developers build scalab...         App Engine   \n",
       "2  Google Kubernetes Engine is a powerful cluster...  Kubernetes Engine   \n",
       "3  GKE On-Prem will provision and manage the unde...        GKE On-Prem   \n",
       "4  Google Cloud Functions makes it easy for devel...    Cloud Functions   \n",
       "\n",
       "                                   short_description  \n",
       "0                    Scalable, high performance VMs.  \n",
       "1  Serverless application platform for apps and b...  \n",
       "2                    Run containerized applications.  \n",
       "3  Make apps “cloud-ready” and move them to the c...  \n",
       "4          Event-driven serverless compute platform.  "
      ]
     },
     "execution_count": 148,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "google_services = pd.read_csv('../data/raw/google_services.csv')\n",
    "google_services.fillna('', inplace=True)\n",
    "google_services.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "AWS Categories\n",
      "['Analytics', 'Application Integration', 'AR & VR', 'AWS Cost Management', 'Blockchain', 'Business Applications', 'Compute', 'Customer Engagement', 'Database', 'Desktop & App Streaming', 'Developer Tools', 'Game Tech', 'Internet of Things', 'Machine Learning', 'Management & Governance', 'Media Services', 'Migration & Transfer', 'Mobile', 'Networking & Content Delivery', 'Robotics', 'Satellite', 'Security, Identity & Compliance', 'Storage']\n",
      "\n",
      "Azure Categories\n",
      "['Compute', 'Networking', 'Storage', 'Web', 'Mobile', 'Containers', 'Databases', 'Analytics', 'AI + Machine Learning', 'Internet of Things', 'Integration', 'Identity', 'Security', 'DevOps', 'Developer Tools', 'Management Tools', 'Media', 'Migration', 'Azure Stack', 'Sovereign Clouds']\n",
      "\n",
      "Google Cloud Categories\n",
      "['Compute', 'Databases', 'Management tools', 'Apigee API Platform', 'Storage', 'Migration', 'Networking', 'Developer tools', 'Cloud IoT Core', 'Anvato', 'Data analytics', 'AI and machine learning', 'Cloud IAM', 'VPC Service Controls', 'Gmail', 'Admin', 'Docs', 'Drive', 'Maps', 'Ridesharing', 'Jamboard', 'Chrome Enterprise', 'Consulting', 'Technical Account Management']\n"
     ]
    }
   ],
   "source": [
    "print('AWS Categories')\n",
    "aws_categories = list(aws_services['category_name'].unique())\n",
    "print(aws_categories)\n",
    "print()\n",
    "print('Azure Categories')\n",
    "azure_categories = list(azure_services['category_name'].unique())\n",
    "print(azure_categories)\n",
    "print()\n",
    "print('Google Cloud Categories')\n",
    "google_categories = list(google_services['category_name'].unique())\n",
    "print(google_categories)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'Analytics': 'Analytics',\n",
       " 'Integration': 'Integration',\n",
       " 'Application Integration': 'Integration',\n",
       " 'Compute': 'Compute',\n",
       " 'Databases': 'Database',\n",
       " 'Database': 'Database',\n",
       " 'Developer Tools': 'Developer Tools',\n",
       " 'Internet of Things': 'Internet of Things',\n",
       " 'AI + Machine Learning': 'Machine Learning',\n",
       " 'Machine Learning': 'Machine Learning',\n",
       " 'Media': 'Media',\n",
       " 'Media Services': 'Media',\n",
       " 'Migration': 'Migration',\n",
       " 'Migration & Transfer': 'Migration',\n",
       " 'Mobile': 'Mobile',\n",
       " 'Networking': 'Networking',\n",
       " 'Networking & Content Delivery': 'Networking',\n",
       " 'Identity': 'Identity',\n",
       " 'Security, Identity & Compliance': 'Security',\n",
       " 'Security': 'Security',\n",
       " 'Storage': 'Storage'}"
      ]
     },
     "execution_count": 83,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "normalized_cats = {}\n",
    "for aws_cat in aws_categories:\n",
    "    for azure_cat in azure_categories:\n",
    "        if fuzz.ratio(aws_cat, azure_cat) > 75 or aws_cat in azure_cat or azure_cat in aws_cat:\n",
    "            \n",
    "            if len(aws_cat) > len(azure_cat):\n",
    "                norm = azure_cat\n",
    "            else:\n",
    "                norm = aws_cat\n",
    "\n",
    "            normalized_cats[azure_cat] = norm\n",
    "            normalized_cats[aws_cat] = norm\n",
    "            \n",
    "normalized_cats"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 170,
   "metadata": {},
   "outputs": [],
   "source": [
    "class GremlinQueryManager:\n",
    "    def __init__(self, account_name, master_key, database_name, graph_name):\n",
    "        self.client = client.Client(\n",
    "            'wss://{}.gremlin.cosmosdb.azure.com:443/'.format(account_name),\n",
    "            'g',\n",
    "            username=\"/dbs/{}/colls/{}\".format(database_name, graph_name),\n",
    "            password=master_key,\n",
    "            message_serializer=serializer.GraphSONSerializersV2d0()\n",
    "        )\n",
    "\n",
    "    def query(self, query):\n",
    "        callback = self.client.submitAsync(query)\n",
    "        if callback.result():\n",
    "            res = []\n",
    "            for r in callback.result():\n",
    "                res += r\n",
    "        return res\n",
    "\n",
    "\n",
    "load_dotenv(find_dotenv())\n",
    "\n",
    "account_name = os.environ.get('COSMOS_ACCOUNT_NAME')\n",
    "db_name = os.environ.get('COSMOS_DB_NAME')\n",
    "graph_name = os.environ.get('COSMOS_GRAPH_NAME')\n",
    "master_key = os.environ.get('COSMOS_MASTER_KEY')\n",
    "\n",
    "gremlin_qm = GremlinQueryManager(account_name, master_key, db_name, graph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 160,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "class GremlinQueryBuilder:\n",
    "    \"\"\"\n",
    "    Basic functions to build gremlin queries that add vertices and edges\n",
    "    \"\"\"\n",
    "    @classmethod\n",
    "    def gremlin_escape(cls, s):\n",
    "        return s.replace('\"', '\\\\\"').replace('$', '\\\\$')\n",
    "    \n",
    "    @classmethod\n",
    "    def build_upsert_vertex_query(cls, entity_type, properties):\n",
    "        q = f\"\"\"g.V().has(\"label\", \"{entity_type}\"){cls.get_properties_str(properties, False)}.\n",
    "                fold().\n",
    "                coalesce(unfold(),\n",
    "                         addV(\"{entity_type}\"){cls.get_properties_str(properties)})\"\"\"\n",
    "        return q\n",
    "\n",
    "    @classmethod\n",
    "    def build_upsert_edge_query(cls, from_id, to_id, edge_properties):\n",
    "        \"\"\"\n",
    "        g.V().has('person','name','vadas').as('v').\n",
    "           V().has('software','name','ripple').\n",
    "           coalesce(__.inE('created').where(outV().as('v')),\n",
    "                    addE('created').from('v').property('weight',0.5))\n",
    "        \"\"\"\n",
    "        label = edge_properties[\"label\"]\n",
    "        return f\"\"\"g.V(\"{from_id}\").as('v').\n",
    "                    V(\"{to_id}\").\n",
    "                    coalesce(__.inE(\"{label}\").where(outV().as('v')),\n",
    "                             addE(\"{label}\").from('v'){cls.get_properties_str(edge_properties)})\"\"\"\n",
    "    \n",
    "    @classmethod\n",
    "    def get_by_id_query(cls, _id):\n",
    "        return 'g.V(\"{}\")'.format(_id)\n",
    "    \n",
    "    @classmethod\n",
    "    def get_properties_str(cls, properties, create=True):\n",
    "        if create:\n",
    "            query_str = 'property'\n",
    "        else:\n",
    "            query_str = 'has'\n",
    "        \n",
    "    \n",
    "        properties_lower = {k.lower():v for k,v in properties.items()}\n",
    "        \n",
    "        if \"label\" in properties_lower:\n",
    "            del properties_lower[\"label\"]\n",
    "\n",
    "        output = \"\"\n",
    "        for k, v in properties_lower.items():\n",
    "            if isinstance(v, str):\n",
    "                output += '.{}(\"{}\", \"{}\")'.format(query_str, k, v)\n",
    "            else:\n",
    "                output += '.{}(\"{}\", {})'.format(query_str, k, v)\n",
    "        return output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "g.V(\"4952feb6-55dc-4d8f-9d63-4fca5c4265e3\").as('v').\n",
      "                    V(\"b8e694c2-4e0b-4c17-b01b-b00670caaa6e\").\n",
      "                    coalesce(__.inE(\"source_cloud\").where(outV().as('v')),\n",
      "                             addE(\"source_cloud\").from('v'))\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'id': 'b0e40429-37b6-4d0b-806e-a64163d8b1ae',\n",
       "  'label': 'source_cloud',\n",
       "  'type': 'edge',\n",
       "  'inVLabel': 'cloud',\n",
       "  'outVLabel': 'aws_category',\n",
       "  'inV': 'b8e694c2-4e0b-4c17-b01b-b00670caaa6e',\n",
       "  'outV': '4952feb6-55dc-4d8f-9d63-4fca5c4265e3'}]"
      ]
     },
     "execution_count": 122,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "test_eq = GremlinQueryBuilder.build_upsert_edge_query('4952feb6-55dc-4d8f-9d63-4fca5c4265e3', 'b8e694c2-4e0b-4c17-b01b-b00670caaa6e', {'label': 'source_cloud'})\n",
    "print(test_eq)\n",
    "gremlin_qm.query(test_eq)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Analytics Analytics\n"
     ]
    },
    {
     "ename": "AttributeError",
     "evalue": "type object 'GremlinQueryBuilder' has no attribute 'build_add_vertex_query'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mAttributeError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-157-14a6139f6e50>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      5\u001b[0m         \u001b[0mnorm_category_id\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mcategory_res\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'id'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      6\u001b[0m     \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 7\u001b[0;31m         \u001b[0mvq\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mGremlinQueryBuilder\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbuild_add_vertex_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'category'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m'name'\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mnorm\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      8\u001b[0m         \u001b[0mnorm_category_id\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgremlin_qm\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mvq\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'id'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      9\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mAttributeError\u001b[0m: type object 'GremlinQueryBuilder' has no attribute 'build_add_vertex_query'"
     ]
    }
   ],
   "source": [
    "for text, norm in normalized_cats.items():\n",
    "    print(text, norm)\n",
    "    category_res = gremlin_qm.query(f\"g.V().has('name', '{norm}').has('label', 'category')\")\n",
    "    if category_res:\n",
    "        norm_category_id = category_res[0]['id']\n",
    "    else:\n",
    "        vq = GremlinQueryBuilder.build_add_vertex_query('category', {'name': norm})\n",
    "        norm_category_id = gremlin_qm.query(vq)[0]['id']\n",
    "\n",
    "    cloud_source_category_id = gremlin_qm.query(f\"g.V().has('name', '{text}')\")[0]['id']\n",
    "    \n",
    "    eq = GremlinQueryBuilder.build_add_edge_query(cloud_source_category_id, norm_category_id, {'label': 'super_category'})\n",
    "    gremlin_qm.query(eq)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add clouds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "metadata": {},
   "outputs": [],
   "source": [
    "sources = {\n",
    "    'aws': 'Amazon Web Services', \n",
    "    'azure': 'Microsoft Azure', \n",
    "    'gcp': 'Google Cloud'\n",
    "}\n",
    "for abbreviation, source in sources.items():    \n",
    "    q = GremlinQueryBuilder.build_upsert_vertex_query('cloud', {'name': source, 'abbreviation': abbreviation})\n",
    "    gremlin_qm.query(q)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add cloud categories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i, source in enumerate([aws_categories, azure_categories, google_categories]):\n",
    "    abbr = list(sources.keys())[i]\n",
    "    r = gremlin_qm.query(f\"g.V().has('abbreviation', '{abbr}')\")\n",
    "    cloud_id = r[0]['id']\n",
    "    \n",
    "    for cat in source:\n",
    "        vq = GremlinQueryBuilder.build_upsert_vertex_query(f'{abbr}_category', {'name': cat})\n",
    "        v_id = gremlin_qm.query(vq)[0]['id']\n",
    "        eq = GremlinQueryBuilder.build_upsert_edge_query(v_id, cloud_id, {'label': 'source_cloud'})\n",
    "        gremlin_qm.query(eq)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add services for each cloud category"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adding services for Amazon Web Services\n",
      "Adding services for Microsoft Azure\n",
      "Adding services for Google Cloud\n"
     ]
    }
   ],
   "source": [
    "for abbr, df in zip(sources.keys(), [aws_services, azure_services, google_services]):\n",
    "    source_name = sources[abbr]\n",
    "    print(f\"Adding services for {source_name}\")\n",
    "    def add_service_and_edge(row):\n",
    "        label = f'{abbr}_service'\n",
    "        props = {\n",
    "            'name': row['name'],\n",
    "            'short_description': row['short_description'],\n",
    "            'long_description': row['long_description'],\n",
    "            'uri': row['link'],\n",
    "            'icon_uri': row['icon']\n",
    "        }\n",
    "        for k, v in props.items():\n",
    "            props[k] = GremlinQueryBuilder.gremlin_escape(v)\n",
    "        vq = GremlinQueryBuilder.build_upsert_vertex_query(label, props)\n",
    "        \n",
    "        v_res = gremlin_qm.query(vq)    \n",
    "\n",
    "        cat_name = row['category_name']\n",
    "        cat_id = gremlin_qm.query(f\"g.V().has('name', '{cat_name}').has('label', '{abbr}_category')\")[0]['id']\n",
    "\n",
    "        cat_eq = GremlinQueryBuilder.build_upsert_edge_query(v_res[0]['id'], cat_id, {'label': 'belongs_to'})\n",
    "        gremlin_qm.query(cat_eq)\n",
    "\n",
    "\n",
    "    df.apply(add_service_and_edge, axis=1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
