{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import find_dotenv, load_dotenv\n",
    "import os\n",
    "import pandas as pd\n",
    "from fuzzywuzzy import fuzz\n",
    "import configparser\n",
    "from azure.cosmos.cosmos_client import CosmosClient\n",
    "from gremlin_python.driver import client, serializer\n",
    "import requests\n",
    "import pandas as pd\n",
    "import re"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category_id</th>\n",
       "      <th>category_name</th>\n",
       "      <th>icon</th>\n",
       "      <th>link</th>\n",
       "      <th>long_description</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/athena/?c=1&amp;pt=1</td>\n",
       "      <td>Amazon Athena is an interactive query service ...</td>\n",
       "      <td>Amazon Athena</td>\n",
       "      <td>Query Data in S3 using SQL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/cloudsearch/?c=1&amp;pt=2</td>\n",
       "      <td>Related Links\\nGet Started for Free\\nAmazon Cl...</td>\n",
       "      <td>Amazon CloudSearch</td>\n",
       "      <td>Managed Search Service</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/elasticsearch-service/?...</td>\n",
       "      <td>Amazon Elasticsearch Service is a fully manage...</td>\n",
       "      <td>Amazon Elasticsearch Service</td>\n",
       "      <td>Run and Scale Elasticsearch Clusters</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/elasticmapreduce/?c=1&amp;pt=4</td>\n",
       "      <td>Amazon EMR provides a managed Hadoop framework...</td>\n",
       "      <td>Amazon EMR</td>\n",
       "      <td>Hosted Hadoop Framework</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>Analytics</td>\n",
       "      <td></td>\n",
       "      <td>https://aws.amazon.com/kinesis/?c=1&amp;pt=5</td>\n",
       "      <td>Amazon Kinesis makes it easy to collect, proce...</td>\n",
       "      <td>Amazon Kinesis</td>\n",
       "      <td>Work with Real-time Streaming Data</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   category_id category_name icon  \\\n",
       "0            1     Analytics        \n",
       "1            1     Analytics        \n",
       "2            1     Analytics        \n",
       "3            1     Analytics        \n",
       "4            1     Analytics        \n",
       "\n",
       "                                                link  \\\n",
       "0            https://aws.amazon.com/athena/?c=1&pt=1   \n",
       "1       https://aws.amazon.com/cloudsearch/?c=1&pt=2   \n",
       "2  https://aws.amazon.com/elasticsearch-service/?...   \n",
       "3  https://aws.amazon.com/elasticmapreduce/?c=1&pt=4   \n",
       "4           https://aws.amazon.com/kinesis/?c=1&pt=5   \n",
       "\n",
       "                                    long_description  \\\n",
       "0  Amazon Athena is an interactive query service ...   \n",
       "1  Related Links\\nGet Started for Free\\nAmazon Cl...   \n",
       "2  Amazon Elasticsearch Service is a fully manage...   \n",
       "3  Amazon EMR provides a managed Hadoop framework...   \n",
       "4  Amazon Kinesis makes it easy to collect, proce...   \n",
       "\n",
       "                           name                     short_description  \n",
       "0                 Amazon Athena            Query Data in S3 using SQL  \n",
       "1            Amazon CloudSearch                Managed Search Service  \n",
       "2  Amazon Elasticsearch Service  Run and Scale Elasticsearch Clusters  \n",
       "3                    Amazon EMR               Hosted Hadoop Framework  \n",
       "4                Amazon Kinesis    Work with Real-time Streaming Data  "
      ]
     },
     "execution_count": 146,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "aws_services = pd.read_csv('../data/raw/aws_services.csv')\n",
    "aws_services.fillna('', inplace=True)\n",
    "aws_services.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category_id</th>\n",
       "      <th>category_name</th>\n",
       "      <th>icon</th>\n",
       "      <th>link</th>\n",
       "      <th>long_description</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/virtual...</td>\n",
       "      <td>Provision virtual machines of Ubuntu, Red Hat,...</td>\n",
       "      <td>Azure Linux Virtual Machines</td>\n",
       "      <td>Provision virtual machines of Ubuntu, Red Hat,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/virtual...</td>\n",
       "      <td>Provision virtual machines for SQL Server, Sha...</td>\n",
       "      <td>Azure Windows Virtual Machines</td>\n",
       "      <td>Provision virtual machines for SQL Server, Sha...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/app-ser...</td>\n",
       "      <td>Quickly create powerful cloud apps for web and...</td>\n",
       "      <td>Azure App Service</td>\n",
       "      <td>Quickly create powerful cloud apps for web and...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/azure-f...</td>\n",
       "      <td>Process events with serverless code</td>\n",
       "      <td>Azure Functions</td>\n",
       "      <td>Process events with serverless code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Compute</td>\n",
       "      <td>Compute</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/media/i...</td>\n",
       "      <td>https://docs.microsoft.com/en-us/azure/batch/</td>\n",
       "      <td>Cloud-scale job scheduling and compute management</td>\n",
       "      <td>Azure Batch</td>\n",
       "      <td>Cloud-scale job scheduling and compute management</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  category_id category_name  \\\n",
       "0     Compute       Compute   \n",
       "1     Compute       Compute   \n",
       "2     Compute       Compute   \n",
       "3     Compute       Compute   \n",
       "4     Compute       Compute   \n",
       "\n",
       "                                                icon  \\\n",
       "0  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "1  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "2  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "3  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "4  https://docs.microsoft.com/en-us/azure/media/i...   \n",
       "\n",
       "                                                link  \\\n",
       "0  https://docs.microsoft.com/en-us/azure/virtual...   \n",
       "1  https://docs.microsoft.com/en-us/azure/virtual...   \n",
       "2  https://docs.microsoft.com/en-us/azure/app-ser...   \n",
       "3  https://docs.microsoft.com/en-us/azure/azure-f...   \n",
       "4      https://docs.microsoft.com/en-us/azure/batch/   \n",
       "\n",
       "                                    long_description  \\\n",
       "0  Provision virtual machines of Ubuntu, Red Hat,...   \n",
       "1  Provision virtual machines for SQL Server, Sha...   \n",
       "2  Quickly create powerful cloud apps for web and...   \n",
       "3                Process events with serverless code   \n",
       "4  Cloud-scale job scheduling and compute management   \n",
       "\n",
       "                             name  \\\n",
       "0    Azure Linux Virtual Machines   \n",
       "1  Azure Windows Virtual Machines   \n",
       "2               Azure App Service   \n",
       "3                 Azure Functions   \n",
       "4                     Azure Batch   \n",
       "\n",
       "                                   short_description  \n",
       "0  Provision virtual machines of Ubuntu, Red Hat,...  \n",
       "1  Provision virtual machines for SQL Server, Sha...  \n",
       "2  Quickly create powerful cloud apps for web and...  \n",
       "3                Process events with serverless code  \n",
       "4  Cloud-scale job scheduling and compute management  "
      ]
     },
     "execution_count": 147,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "azure_services = pd.read_csv('../data/raw/azure_services.csv')\n",
    "azure_services.fillna('', inplace=True)\n",
    "azure_services.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category_name</th>\n",
       "      <th>icon</th>\n",
       "      <th>link</th>\n",
       "      <th>long_description</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/compute/</td>\n",
       "      <td>Google Compute Engine offers high performance ...</td>\n",
       "      <td>Compute Engine</td>\n",
       "      <td>Scalable, high performance VMs.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/appengine/</td>\n",
       "      <td>Google App Engine lets developers build scalab...</td>\n",
       "      <td>App Engine</td>\n",
       "      <td>Serverless application platform for apps and b...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/kubernetes-engine/</td>\n",
       "      <td>Google Kubernetes Engine is a powerful cluster...</td>\n",
       "      <td>Kubernetes Engine</td>\n",
       "      <td>Run containerized applications.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/gke-on-prem/</td>\n",
       "      <td>GKE On-Prem will provision and manage the unde...</td>\n",
       "      <td>GKE On-Prem</td>\n",
       "      <td>Make apps “cloud-ready” and move them to the c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Compute</td>\n",
       "      <td>https://cloud.google.com/products/_static/imag...</td>\n",
       "      <td>https://cloud.google.com/functions/</td>\n",
       "      <td>Google Cloud Functions makes it easy for devel...</td>\n",
       "      <td>Cloud Functions</td>\n",
       "      <td>Event-driven serverless compute platform.</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  category_name                                               icon  \\\n",
       "0       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "1       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "2       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "3       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "4       Compute  https://cloud.google.com/products/_static/imag...   \n",
       "\n",
       "                                          link  \\\n",
       "0            https://cloud.google.com/compute/   \n",
       "1          https://cloud.google.com/appengine/   \n",
       "2  https://cloud.google.com/kubernetes-engine/   \n",
       "3        https://cloud.google.com/gke-on-prem/   \n",
       "4          https://cloud.google.com/functions/   \n",
       "\n",
       "                                    long_description               name  \\\n",
       "0  Google Compute Engine offers high performance ...     Compute Engine   \n",
       "1  Google App Engine lets developers build scalab...         App Engine   \n",
       "2  Google Kubernetes Engine is a powerful cluster...  Kubernetes Engine   \n",
       "3  GKE On-Prem will provision and manage the unde...        GKE On-Prem   \n",
       "4  Google Cloud Functions makes it easy for devel...    Cloud Functions   \n",
       "\n",
       "                                   short_description  \n",
       "0                    Scalable, high performance VMs.  \n",
       "1  Serverless application platform for apps and b...  \n",
       "2                    Run containerized applications.  \n",
       "3  Make apps “cloud-ready” and move them to the c...  \n",
       "4          Event-driven serverless compute platform.  "
      ]
     },
     "execution_count": 148,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "google_services = pd.read_csv('../data/raw/google_services.csv')\n",
    "google_services.fillna('', inplace=True)\n",
    "google_services.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import concurrent.futures\n",
    "from azure.cosmos.cosmos_client import CosmosClient\n",
    "from gremlin_python.driver import client, serializer\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python import statics\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.process.strategies import *\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "from gremlin_python.process.traversal import T\n",
    "from gremlin_python.process.traversal import Order\n",
    "from gremlin_python.process.traversal import Cardinality\n",
    "from gremlin_python.process.traversal import Column\n",
    "from gremlin_python.process.traversal import Direction\n",
    "from gremlin_python.process.traversal import Operator\n",
    "from gremlin_python.process.traversal import P\n",
    "from gremlin_python.process.traversal import Pop\n",
    "from gremlin_python.process.traversal import Scope\n",
    "from gremlin_python.process.traversal import Barrier\n",
    "from gremlin_python.process.traversal import Bindings\n",
    "# from gremlin_python.process.traversal import WithOptions\n",
    "\n",
    "\n",
    "import logging\n",
    "\n",
    "\n",
    "class GremlinQueryManager:\n",
    "    def __init__(self, account_name, master_key, database_name, graph_name):\n",
    "        \n",
    "        self.driver_remote_connection = DriverRemoteConnection(\n",
    "            f'wss://{account_name}.gremlin.cosmosdb.azure.com:443/',\n",
    "            'g',\n",
    "            username=f'/dbs/{database_name}/colls/{graph_name}',\n",
    "            password=master_key,\n",
    "            message_serializer=serializer.GraphSONMessageSerializer()\n",
    "        )\n",
    "\n",
    "        self.g = self.setup_graph()\n",
    "        \n",
    "    def setup_graph(self):\n",
    "        try:\n",
    "            graph = Graph()\n",
    "            logging.info('Trying To Login')\n",
    "            g = graph.traversal().withRemote(self.driver_remote_connection)\n",
    "            logging.info('Successfully Logged In')\n",
    "        except Exception as e:  # Shouldn't really be so broad\n",
    "            logging.error(e, exc_info=True)\n",
    "            raise BadRequestError('Could not connect to Neptune')        \n",
    "        \n",
    "        return g\n",
    "\n",
    "gremlin_qm = GremlinQueryManager(account_name, master_key, db_name, graph_name)\n",
    "gremlin_qm.g.V('ba834b84-4fe3-40c3-94b6-991c7348db52').toList()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<gremlin_python.driver.client.Client object at 0x7f089f81d630>\n",
      "graphtraversalsource[graph[empty]]\n"
     ]
    }
   ],
   "source": [
    "class DocumentQueryManager:\n",
    "    \"\"\"Utitlity class for managing cosmos db client connection\n",
    "    and collections for easy querying.\"\"\"\n",
    "    def __init__(self, account_name, master_key, db_name):\n",
    "        self.client = CosmosClient('https://{}.documents.azure.com:443/'.format(account_name), {\n",
    "            'masterKey': master_key\n",
    "        })\n",
    "        dbs = list(self.client.ReadDatabases())\n",
    "        self.db = dbs[0]['_self']\n",
    "        for d in dbs:\n",
    "            if d['id'] == db_name:\n",
    "                self.db = d['_self']\n",
    "\n",
    "        self.collections = {}\n",
    "        for c in list(self.client.ReadContainers(self.db)):\n",
    "            self.collections[c['id']] = c['_self']\n",
    "\n",
    "\n",
    "class GremlinQueryManager:\n",
    "    def __init__(self, account_name, master_key, database_name, graph_name):\n",
    "        self.client = client.Client(\n",
    "            'wss://{}.gremlin.cosmosdb.azure.com:443/'.format(account_name),\n",
    "            'g',\n",
    "            username=\"/dbs/{}/colls/{}\".format(database_name, graph_name),\n",
    "            password=master_key,\n",
    "            message_serializer=serializer.GraphSONMessageSerializer()\n",
    "        )\n",
    "        \n",
    "        print(self.client)\n",
    "        \n",
    "        self.g = self.setup_graph()\n",
    "        \n",
    "    def setup_graph(self):\n",
    "        try:\n",
    "            graph = Graph()\n",
    "#             connstring = os.environ.get('GRAPH_DB')\n",
    "            logging.info('Trying To Login')\n",
    "            g = graph.traversal().withRemote(self.client._get_connection())\n",
    "            logging.info('Successfully Logged In')\n",
    "        except Exception as e:  # Shouldn't really be so broad\n",
    "            logging.error(e, exc_info=True)\n",
    "            raise BadRequestError('Could not connect to Neptune')\n",
    "            \n",
    "        print(g)\n",
    "        \n",
    "        \n",
    "        return g\n",
    "\n",
    "    def query(self, query):\n",
    "        callback = self.client.submitAsync(query)\n",
    "        return callback.result().one()\n",
    "#         for r in callback.result():\n",
    "#             return r\n",
    "#         for f in concurrent.futures.as_completed([res.all()]):\n",
    "#             print(f.result())\n",
    "#         return res.done.result()\n",
    "#         if callback.result():\n",
    "#             res = []\n",
    "#             for r in callback.result():\n",
    "#                 res += r\n",
    "#         return res\n",
    "\n",
    "\n",
    "load_dotenv(find_dotenv())\n",
    "\n",
    "account_name = os.environ.get('COSMOS_ACCOUNT_NAME')\n",
    "db_name = os.environ.get('COSMOS_DB_NAME')\n",
    "graph_name = os.environ.get('COSMOS_GRAPH_NAME')\n",
    "master_key = os.environ.get('COSMOS_MASTER_KEY')\n",
    "\n",
    "doc_qm = DocumentQueryManager(account_name, master_key, db_name)\n",
    "gremlin_qm = GremlinQueryManager(account_name, master_key, db_name, graph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>_attachments</th>\n",
       "      <th>_etag</th>\n",
       "      <th>_rid</th>\n",
       "      <th>_self</th>\n",
       "      <th>_ts</th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "      <th>name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"17007486-0000-0800-0000-5c44eabe0000\"</td>\n",
       "      <td>taBNAIvLFShiAwAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548020414</td>\n",
       "      <td>a6150c15-7343-4bec-95f8-d0c1a46cbeee</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>[{'_value': 'Analytics', 'id': '454af3e5-286c-...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"17007a86-0000-0800-0000-5c44eabe0000\"</td>\n",
       "      <td>taBNAIvLFShkAwAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548020414</td>\n",
       "      <td>37b89fe4-26da-4a9a-9230-967c25edb50f</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>[{'_value': 'Application Integration', 'id': '...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"17008186-0000-0800-0000-5c44eabf0000\"</td>\n",
       "      <td>taBNAIvLFShmAwAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548020415</td>\n",
       "      <td>e94f937f-5e38-4efc-825b-3a1c307be238</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>[{'_value': 'AR &amp; VR', 'id': '3c685d37-f9aa-4d...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"17008386-0000-0800-0000-5c44eabf0000\"</td>\n",
       "      <td>taBNAIvLFShoAwAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548020415</td>\n",
       "      <td>22876f29-d576-4400-a50e-4716af003e26</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>[{'_value': 'AWS Cost Management', 'id': '6bfc...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"17008d86-0000-0800-0000-5c44eabf0000\"</td>\n",
       "      <td>taBNAIvLFShqAwAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548020415</td>\n",
       "      <td>80c596f0-5591-4264-bfbd-426b62af3ce3</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>[{'_value': 'Blockchain', 'id': '770dc6d7-ae9f...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   _attachments                                   _etag  \\\n",
       "0  attachments/  \"17007486-0000-0800-0000-5c44eabe0000\"   \n",
       "1  attachments/  \"17007a86-0000-0800-0000-5c44eabe0000\"   \n",
       "2  attachments/  \"17008186-0000-0800-0000-5c44eabf0000\"   \n",
       "3  attachments/  \"17008386-0000-0800-0000-5c44eabf0000\"   \n",
       "4  attachments/  \"17008d86-0000-0800-0000-5c44eabf0000\"   \n",
       "\n",
       "                       _rid  \\\n",
       "0  taBNAIvLFShiAwAAAAAAAA==   \n",
       "1  taBNAIvLFShkAwAAAAAAAA==   \n",
       "2  taBNAIvLFShmAwAAAAAAAA==   \n",
       "3  taBNAIvLFShoAwAAAAAAAA==   \n",
       "4  taBNAIvLFShqAwAAAAAAAA==   \n",
       "\n",
       "                                               _self         _ts  \\\n",
       "0  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548020414   \n",
       "1  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548020414   \n",
       "2  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548020415   \n",
       "3  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548020415   \n",
       "4  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548020415   \n",
       "\n",
       "                                     id         label  \\\n",
       "0  a6150c15-7343-4bec-95f8-d0c1a46cbeee  aws_category   \n",
       "1  37b89fe4-26da-4a9a-9230-967c25edb50f  aws_category   \n",
       "2  e94f937f-5e38-4efc-825b-3a1c307be238  aws_category   \n",
       "3  22876f29-d576-4400-a50e-4716af003e26  aws_category   \n",
       "4  80c596f0-5591-4264-bfbd-426b62af3ce3  aws_category   \n",
       "\n",
       "                                                name  \n",
       "0  [{'_value': 'Analytics', 'id': '454af3e5-286c-...  \n",
       "1  [{'_value': 'Application Integration', 'id': '...  \n",
       "2  [{'_value': 'AR & VR', 'id': '3c685d37-f9aa-4d...  \n",
       "3  [{'_value': 'AWS Cost Management', 'id': '6bfc...  \n",
       "4  [{'_value': 'Blockchain', 'id': '770dc6d7-ae9f...  "
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# def get_services():\n",
    "abbr = 'aws'\n",
    "\n",
    "cats = list(doc_qm.client.QueryItems(\n",
    "    doc_qm.collections['ccg'],\n",
    "    f\"select * from c where c.label = '{abbr}_category'\",\n",
    "    {'enableCrossPartitionQuery': True}\n",
    "))\n",
    "services = list(doc_qm.client.QueryItems(\n",
    "    doc_qm.collections['ccg'],\n",
    "    f\"select * from c where c.label = '{abbr}_service'\",\n",
    "    {'enableCrossPartitionQuery': True}\n",
    "))\n",
    "\n",
    "edges = list(doc_qm.client.QueryItems(\n",
    "    doc_qm.collections['ccg'],\n",
    "    f\"select * from c where c.label = 'belongs_to'\",\n",
    "    {'enableCrossPartitionQuery': True}\n",
    "))\n",
    "cats_df = pd.DataFrame(cats)\n",
    "\n",
    "cats_df.head()\n",
    "\n",
    "# data_records = {}\n",
    "\n",
    "# for s in services:\n",
    "#     data_records[s['id']] = {\n",
    "#         'name': extract_value(s['name']),\n",
    "#         'short_description': extract_value(s['short_description']),\n",
    "#         'long_description': extract_value(s['long_description']),\n",
    "#     }\n",
    "# return data_records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>_attachments</th>\n",
       "      <th>_etag</th>\n",
       "      <th>_rid</th>\n",
       "      <th>_self</th>\n",
       "      <th>_ts</th>\n",
       "      <th>icon_uri</th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "      <th>long_description</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "      <th>uri</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"21007cbd-0000-0800-0000-5c457fc90000\"</td>\n",
       "      <td>taBNAIvLFSgrEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548058569</td>\n",
       "      <td>[{'_value': '', 'id': 'b3cb5385-7112-4f92-9be9...</td>\n",
       "      <td>f37802bd-8656-4abd-a7c2-72eb8f6419d8</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>[{'_value': 'Amazon Athena is an interactive q...</td>\n",
       "      <td>[{'_value': 'Amazon Athena', 'id': 'ee392f74-0...</td>\n",
       "      <td>[{'_value': 'Query Data in S3 using SQL', 'id'...</td>\n",
       "      <td>[{'_value': 'https://aws.amazon.com/athena/?c=...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"210082bd-0000-0800-0000-5c457fcb0000\"</td>\n",
       "      <td>taBNAIvLFSgtEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548058571</td>\n",
       "      <td>[{'_value': '', 'id': '1e346118-9b10-4472-815b...</td>\n",
       "      <td>5f10bdb8-0e7b-4341-b630-4e7864584e3e</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>[{'_value': 'Related Links\n",
       "Get Started for Fre...</td>\n",
       "      <td>[{'_value': 'Amazon CloudSearch', 'id': 'c28b9...</td>\n",
       "      <td>[{'_value': 'Managed Search Service', 'id': '6...</td>\n",
       "      <td>[{'_value': 'https://aws.amazon.com/cloudsearc...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"210088bd-0000-0800-0000-5c457fcc0000\"</td>\n",
       "      <td>taBNAIvLFSgvEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548058572</td>\n",
       "      <td>[{'_value': '', 'id': '438090a4-3ca3-45bd-b9ef...</td>\n",
       "      <td>cfdd7ff5-cc6e-4612-add5-aab78b38ae0c</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>[{'_value': 'Amazon Elasticsearch Service is a...</td>\n",
       "      <td>[{'_value': 'Amazon Elasticsearch Service', 'i...</td>\n",
       "      <td>[{'_value': 'Run and Scale Elasticsearch Clust...</td>\n",
       "      <td>[{'_value': 'https://aws.amazon.com/elasticsea...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"21008abd-0000-0800-0000-5c457fcc0000\"</td>\n",
       "      <td>taBNAIvLFSgxEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548058572</td>\n",
       "      <td>[{'_value': '', 'id': 'c3b474f1-d80c-4cfd-b16a...</td>\n",
       "      <td>90825abf-b36a-4201-9f3c-10c24bc30e80</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>[{'_value': 'Amazon EMR provides a managed Had...</td>\n",
       "      <td>[{'_value': 'Amazon EMR', 'id': '61d76a4d-06c7...</td>\n",
       "      <td>[{'_value': 'Hosted Hadoop Framework', 'id': '...</td>\n",
       "      <td>[{'_value': 'https://aws.amazon.com/elasticmap...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"21008cbd-0000-0800-0000-5c457fcc0000\"</td>\n",
       "      <td>taBNAIvLFSgzEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>1548058572</td>\n",
       "      <td>[{'_value': '', 'id': '0cf4bf66-59f2-4695-82b1...</td>\n",
       "      <td>9686652a-a60c-4150-b988-1beda5265373</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>[{'_value': 'Amazon Kinesis makes it easy to c...</td>\n",
       "      <td>[{'_value': 'Amazon Kinesis', 'id': 'bbf99a28-...</td>\n",
       "      <td>[{'_value': 'Work with Real-time Streaming Dat...</td>\n",
       "      <td>[{'_value': 'https://aws.amazon.com/kinesis/?c...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   _attachments                                   _etag  \\\n",
       "0  attachments/  \"21007cbd-0000-0800-0000-5c457fc90000\"   \n",
       "1  attachments/  \"210082bd-0000-0800-0000-5c457fcb0000\"   \n",
       "2  attachments/  \"210088bd-0000-0800-0000-5c457fcc0000\"   \n",
       "3  attachments/  \"21008abd-0000-0800-0000-5c457fcc0000\"   \n",
       "4  attachments/  \"21008cbd-0000-0800-0000-5c457fcc0000\"   \n",
       "\n",
       "                       _rid  \\\n",
       "0  taBNAIvLFSgrEAAAAAAAAA==   \n",
       "1  taBNAIvLFSgtEAAAAAAAAA==   \n",
       "2  taBNAIvLFSgvEAAAAAAAAA==   \n",
       "3  taBNAIvLFSgxEAAAAAAAAA==   \n",
       "4  taBNAIvLFSgzEAAAAAAAAA==   \n",
       "\n",
       "                                               _self         _ts  \\\n",
       "0  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548058569   \n",
       "1  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548058571   \n",
       "2  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548058572   \n",
       "3  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548058572   \n",
       "4  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...  1548058572   \n",
       "\n",
       "                                            icon_uri  \\\n",
       "0  [{'_value': '', 'id': 'b3cb5385-7112-4f92-9be9...   \n",
       "1  [{'_value': '', 'id': '1e346118-9b10-4472-815b...   \n",
       "2  [{'_value': '', 'id': '438090a4-3ca3-45bd-b9ef...   \n",
       "3  [{'_value': '', 'id': 'c3b474f1-d80c-4cfd-b16a...   \n",
       "4  [{'_value': '', 'id': '0cf4bf66-59f2-4695-82b1...   \n",
       "\n",
       "                                     id        label  \\\n",
       "0  f37802bd-8656-4abd-a7c2-72eb8f6419d8  aws_service   \n",
       "1  5f10bdb8-0e7b-4341-b630-4e7864584e3e  aws_service   \n",
       "2  cfdd7ff5-cc6e-4612-add5-aab78b38ae0c  aws_service   \n",
       "3  90825abf-b36a-4201-9f3c-10c24bc30e80  aws_service   \n",
       "4  9686652a-a60c-4150-b988-1beda5265373  aws_service   \n",
       "\n",
       "                                    long_description  \\\n",
       "0  [{'_value': 'Amazon Athena is an interactive q...   \n",
       "1  [{'_value': 'Related Links\n",
       "Get Started for Fre...   \n",
       "2  [{'_value': 'Amazon Elasticsearch Service is a...   \n",
       "3  [{'_value': 'Amazon EMR provides a managed Had...   \n",
       "4  [{'_value': 'Amazon Kinesis makes it easy to c...   \n",
       "\n",
       "                                                name  \\\n",
       "0  [{'_value': 'Amazon Athena', 'id': 'ee392f74-0...   \n",
       "1  [{'_value': 'Amazon CloudSearch', 'id': 'c28b9...   \n",
       "2  [{'_value': 'Amazon Elasticsearch Service', 'i...   \n",
       "3  [{'_value': 'Amazon EMR', 'id': '61d76a4d-06c7...   \n",
       "4  [{'_value': 'Amazon Kinesis', 'id': 'bbf99a28-...   \n",
       "\n",
       "                                   short_description  \\\n",
       "0  [{'_value': 'Query Data in S3 using SQL', 'id'...   \n",
       "1  [{'_value': 'Managed Search Service', 'id': '6...   \n",
       "2  [{'_value': 'Run and Scale Elasticsearch Clust...   \n",
       "3  [{'_value': 'Hosted Hadoop Framework', 'id': '...   \n",
       "4  [{'_value': 'Work with Real-time Streaming Dat...   \n",
       "\n",
       "                                                 uri  \n",
       "0  [{'_value': 'https://aws.amazon.com/athena/?c=...  \n",
       "1  [{'_value': 'https://aws.amazon.com/cloudsearc...  \n",
       "2  [{'_value': 'https://aws.amazon.com/elasticsea...  \n",
       "3  [{'_value': 'https://aws.amazon.com/elasticmap...  \n",
       "4  [{'_value': 'https://aws.amazon.com/kinesis/?c...  "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "s_df = pd.DataFrame(services)\n",
    "s_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>_attachments</th>\n",
       "      <th>_etag</th>\n",
       "      <th>_isEdge</th>\n",
       "      <th>_rid</th>\n",
       "      <th>_self</th>\n",
       "      <th>_sink</th>\n",
       "      <th>_sinkLabel</th>\n",
       "      <th>_ts</th>\n",
       "      <th>_vertexId</th>\n",
       "      <th>_vertexLabel</th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"21007dbd-0000-0800-0000-5c457fca0000\"</td>\n",
       "      <td>True</td>\n",
       "      <td>taBNAIvLFSgsEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>a6150c15-7343-4bec-95f8-d0c1a46cbeee</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>1548058570</td>\n",
       "      <td>f37802bd-8656-4abd-a7c2-72eb8f6419d8</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>27c194fa-8dea-4ee3-ba8e-c83f52a95ae8</td>\n",
       "      <td>belongs_to</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"210087bd-0000-0800-0000-5c457fcb0000\"</td>\n",
       "      <td>True</td>\n",
       "      <td>taBNAIvLFSguEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>a6150c15-7343-4bec-95f8-d0c1a46cbeee</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>1548058571</td>\n",
       "      <td>5f10bdb8-0e7b-4341-b630-4e7864584e3e</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>080d3407-87c9-424a-bc68-93ff9abfdd3a</td>\n",
       "      <td>belongs_to</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"210089bd-0000-0800-0000-5c457fcc0000\"</td>\n",
       "      <td>True</td>\n",
       "      <td>taBNAIvLFSgwEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>a6150c15-7343-4bec-95f8-d0c1a46cbeee</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>1548058572</td>\n",
       "      <td>cfdd7ff5-cc6e-4612-add5-aab78b38ae0c</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>909f2737-b3d0-4916-925f-1a4f0fd87f6e</td>\n",
       "      <td>belongs_to</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"21008bbd-0000-0800-0000-5c457fcc0000\"</td>\n",
       "      <td>True</td>\n",
       "      <td>taBNAIvLFSgyEAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>a6150c15-7343-4bec-95f8-d0c1a46cbeee</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>1548058572</td>\n",
       "      <td>90825abf-b36a-4201-9f3c-10c24bc30e80</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>f9f8868d-7184-4ad6-be13-4ca5e2df9f84</td>\n",
       "      <td>belongs_to</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>attachments/</td>\n",
       "      <td>\"21008dbd-0000-0800-0000-5c457fcc0000\"</td>\n",
       "      <td>True</td>\n",
       "      <td>taBNAIvLFSg0EAAAAAAAAA==</td>\n",
       "      <td>dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...</td>\n",
       "      <td>a6150c15-7343-4bec-95f8-d0c1a46cbeee</td>\n",
       "      <td>aws_category</td>\n",
       "      <td>1548058572</td>\n",
       "      <td>9686652a-a60c-4150-b988-1beda5265373</td>\n",
       "      <td>aws_service</td>\n",
       "      <td>beea6f72-a0d0-438b-b77a-2237bf500242</td>\n",
       "      <td>belongs_to</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   _attachments                                   _etag  _isEdge  \\\n",
       "0  attachments/  \"21007dbd-0000-0800-0000-5c457fca0000\"     True   \n",
       "1  attachments/  \"210087bd-0000-0800-0000-5c457fcb0000\"     True   \n",
       "2  attachments/  \"210089bd-0000-0800-0000-5c457fcc0000\"     True   \n",
       "3  attachments/  \"21008bbd-0000-0800-0000-5c457fcc0000\"     True   \n",
       "4  attachments/  \"21008dbd-0000-0800-0000-5c457fcc0000\"     True   \n",
       "\n",
       "                       _rid  \\\n",
       "0  taBNAIvLFSgsEAAAAAAAAA==   \n",
       "1  taBNAIvLFSguEAAAAAAAAA==   \n",
       "2  taBNAIvLFSgwEAAAAAAAAA==   \n",
       "3  taBNAIvLFSgyEAAAAAAAAA==   \n",
       "4  taBNAIvLFSg0EAAAAAAAAA==   \n",
       "\n",
       "                                               _self  \\\n",
       "0  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...   \n",
       "1  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...   \n",
       "2  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...   \n",
       "3  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...   \n",
       "4  dbs/taBNAA==/colls/taBNAIvLFSg=/docs/taBNAIvLF...   \n",
       "\n",
       "                                  _sink    _sinkLabel         _ts  \\\n",
       "0  a6150c15-7343-4bec-95f8-d0c1a46cbeee  aws_category  1548058570   \n",
       "1  a6150c15-7343-4bec-95f8-d0c1a46cbeee  aws_category  1548058571   \n",
       "2  a6150c15-7343-4bec-95f8-d0c1a46cbeee  aws_category  1548058572   \n",
       "3  a6150c15-7343-4bec-95f8-d0c1a46cbeee  aws_category  1548058572   \n",
       "4  a6150c15-7343-4bec-95f8-d0c1a46cbeee  aws_category  1548058572   \n",
       "\n",
       "                              _vertexId _vertexLabel  \\\n",
       "0  f37802bd-8656-4abd-a7c2-72eb8f6419d8  aws_service   \n",
       "1  5f10bdb8-0e7b-4341-b630-4e7864584e3e  aws_service   \n",
       "2  cfdd7ff5-cc6e-4612-add5-aab78b38ae0c  aws_service   \n",
       "3  90825abf-b36a-4201-9f3c-10c24bc30e80  aws_service   \n",
       "4  9686652a-a60c-4150-b988-1beda5265373  aws_service   \n",
       "\n",
       "                                     id       label  \n",
       "0  27c194fa-8dea-4ee3-ba8e-c83f52a95ae8  belongs_to  \n",
       "1  080d3407-87c9-424a-bc68-93ff9abfdd3a  belongs_to  \n",
       "2  909f2737-b3d0-4916-925f-1a4f0fd87f6e  belongs_to  \n",
       "3  f9f8868d-7184-4ad6-be13-4ca5e2df9f84  belongs_to  \n",
       "4  beea6f72-a0d0-438b-b77a-2237bf500242  belongs_to  "
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "edges_df = pd.DataFrame(edges)\n",
    "edges_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# q = \"\"\"g.V().has('label', 'aws_service')\n",
    "#         .project('name', 'short_description', 'long_description', 'category_name')\n",
    "#         .by('name').by('short_description').by('long_description').by(out('belongs_to').values('name'))\"\"\"\n",
    "# print(''.join(q.split()))\n",
    "# len(gremlin_qm.query(q))\n",
    "\n",
    "# q = \"g.V('ba834b84-4fe3-40c3-94b6-991c7348db52').in('source_cloud')\"\n",
    "q = \"g.V().has('label', 'aws_service')\"\n",
    "len(gremlin_qm.query(q))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 160,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "class GremlinQueryBuilder:\n",
    "    \"\"\"\n",
    "    Basic functions to build gremlin queries that add vertices and edges\n",
    "    \"\"\"\n",
    "    @classmethod\n",
    "    def gremlin_escape(cls, s):\n",
    "        return s.replace('\"', '\\\\\"').replace('$', '\\\\$')\n",
    "    \n",
    "    @classmethod\n",
    "    def build_upsert_vertex_query(cls, entity_type, properties):\n",
    "        q = f\"\"\"g.V().has(\"label\", \"{entity_type}\"){cls.get_properties_str(properties, False)}.\n",
    "                fold().\n",
    "                coalesce(unfold(),\n",
    "                         addV(\"{entity_type}\"){cls.get_properties_str(properties)})\"\"\"\n",
    "        return q\n",
    "\n",
    "    @classmethod\n",
    "    def build_upsert_edge_query(cls, from_id, to_id, edge_properties):\n",
    "        \"\"\"\n",
    "        g.V().has('person','name','vadas').as('v').\n",
    "           V().has('software','name','ripple').\n",
    "           coalesce(__.inE('created').where(outV().as('v')),\n",
    "                    addE('created').from('v').property('weight',0.5))\n",
    "        \"\"\"\n",
    "        label = edge_properties[\"label\"]\n",
    "        return f\"\"\"g.V(\"{from_id}\").as('v').\n",
    "                    V(\"{to_id}\").\n",
    "                    coalesce(__.inE(\"{label}\").where(outV().as('v')),\n",
    "                             addE(\"{label}\").from('v'){cls.get_properties_str(edge_properties)})\"\"\"\n",
    "    \n",
    "    @classmethod\n",
    "    def get_by_id_query(cls, _id):\n",
    "        return 'g.V(\"{}\")'.format(_id)\n",
    "    \n",
    "    @classmethod\n",
    "    def get_properties_str(cls, properties, create=True):\n",
    "        if create:\n",
    "            query_str = 'property'\n",
    "        else:\n",
    "            query_str = 'has'\n",
    "        \n",
    "    \n",
    "        properties_lower = {k.lower():v for k,v in properties.items()}\n",
    "        \n",
    "        if \"label\" in properties_lower:\n",
    "            del properties_lower[\"label\"]\n",
    "\n",
    "        output = \"\"\n",
    "        for k, v in properties_lower.items():\n",
    "            if isinstance(v, str):\n",
    "                output += '.{}(\"{}\", \"{}\")'.format(query_str, k, v)\n",
    "            else:\n",
    "                output += '.{}(\"{}\", {})'.format(query_str, k, v)\n",
    "        return output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "g.V(\"4952feb6-55dc-4d8f-9d63-4fca5c4265e3\").as('v').\n",
      "                    V(\"b8e694c2-4e0b-4c17-b01b-b00670caaa6e\").\n",
      "                    coalesce(__.inE(\"source_cloud\").where(outV().as('v')),\n",
      "                             addE(\"source_cloud\").from('v'))\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'id': 'b0e40429-37b6-4d0b-806e-a64163d8b1ae',\n",
       "  'label': 'source_cloud',\n",
       "  'type': 'edge',\n",
       "  'inVLabel': 'cloud',\n",
       "  'outVLabel': 'aws_category',\n",
       "  'inV': 'b8e694c2-4e0b-4c17-b01b-b00670caaa6e',\n",
       "  'outV': '4952feb6-55dc-4d8f-9d63-4fca5c4265e3'}]"
      ]
     },
     "execution_count": 122,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "test_eq = GremlinQueryBuilder.build_upsert_edge_query('4952feb6-55dc-4d8f-9d63-4fca5c4265e3', 'b8e694c2-4e0b-4c17-b01b-b00670caaa6e', {'label': 'source_cloud'})\n",
    "print(test_eq)\n",
    "gremlin_qm.query(test_eq)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add clouds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "metadata": {},
   "outputs": [],
   "source": [
    "sources = {\n",
    "    'aws': 'Amazon Web Services', \n",
    "    'azure': 'Microsoft Azure', \n",
    "    'gcp': 'Google Cloud'\n",
    "}\n",
    "for abbreviation, source in sources.items():    \n",
    "    q = GremlinQueryBuilder.build_upsert_vertex_query('cloud', {'name': source, 'abbreviation': abbreviation})\n",
    "    gremlin_qm.query(q)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add cloud categories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i, source in enumerate([aws_categories, azure_categories, google_categories]):\n",
    "    abbr = list(sources.keys())[i]\n",
    "    r = gremlin_qm.query(f\"g.V().has('abbreviation', '{abbr}')\")\n",
    "    cloud_id = r[0]['id']\n",
    "    \n",
    "    for cat in source:\n",
    "        vq = GremlinQueryBuilder.build_upsert_vertex_query(f'{abbr}_category', {'name': cat})\n",
    "        v_id = gremlin_qm.query(vq)[0]['id']\n",
    "        eq = GremlinQueryBuilder.build_upsert_edge_query(v_id, cloud_id, {'label': 'source_cloud'})\n",
    "        gremlin_qm.query(eq)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add services for each cloud category"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 204,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adding services for Amazon Web Services\n",
      "Adding services for Microsoft Azure\n",
      "Adding services for Google Cloud\n"
     ]
    }
   ],
   "source": [
    "for abbr, df in zip(sources.keys(), [aws_services, azure_services, google_services]):\n",
    "    source_name = sources[abbr]\n",
    "    print(f\"Adding services for {source_name}\")\n",
    "    def add_service_and_edge(row):\n",
    "        label = f'{abbr}_service'\n",
    "        props = {\n",
    "            'name': row['name'],\n",
    "            'short_description': row['short_description'],\n",
    "            'long_description': row['long_description'],\n",
    "            'uri': row['link'],\n",
    "            'icon_uri': row['icon']\n",
    "        }\n",
    "        for k, v in props.items():\n",
    "            props[k] = GremlinQueryBuilder.gremlin_escape(v)\n",
    "        vq = GremlinQueryBuilder.build_upsert_vertex_query(label, props)\n",
    "        \n",
    "        v_res = gremlin_qm.query(vq)    \n",
    "\n",
    "        cat_name = row['category_name']\n",
    "        cat_id = gremlin_qm.query(f\"g.V().has('name', '{cat_name}').has('label', '{abbr}_category')\")[0]['id']\n",
    "\n",
    "        cat_eq = GremlinQueryBuilder.build_upsert_edge_query(v_res[0]['id'], cat_id, {'label': 'belongs_to'})\n",
    "        gremlin_qm.query(cat_eq)\n",
    "\n",
    "\n",
    "    df.apply(add_service_and_edge, axis=1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "# Conflating Service Categories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 178,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "AWS Categories\n",
      "['Analytics', 'Application Integration', 'AR & VR', 'AWS Cost Management', 'Blockchain', 'Business Applications', 'Compute', 'Customer Engagement', 'Database', 'Desktop & App Streaming', 'Developer Tools', 'Game Tech', 'Internet of Things', 'Machine Learning', 'Management & Governance', 'Media Services', 'Migration & Transfer', 'Mobile', 'Networking & Content Delivery', 'Robotics', 'Satellite', 'Security, Identity & Compliance', 'Storage']\n",
      "\n",
      "Azure Categories\n",
      "['Compute', 'Networking', 'Storage', 'Web', 'Mobile', 'Containers', 'Databases', 'Analytics', 'AI + Machine Learning', 'Internet of Things', 'Integration', 'Identity', 'Security', 'DevOps', 'Developer Tools', 'Management Tools', 'Media', 'Migration', 'Azure Stack', 'Sovereign Clouds']\n",
      "\n",
      "Google Cloud Categories\n",
      "['Compute', 'Databases', 'Management tools', 'Apigee API Platform', 'Storage', 'Migration', 'Networking', 'Developer tools', 'Cloud IoT Core', 'Anvato', 'Data analytics', 'AI and machine learning', 'Cloud IAM', 'VPC Service Controls', 'Gmail', 'Admin', 'Docs', 'Drive', 'Maps', 'Ridesharing', 'Jamboard', 'Chrome Enterprise', 'Consulting', 'Technical Account Management']\n"
     ]
    }
   ],
   "source": [
    "print('AWS Categories')\n",
    "aws_categories = list(aws_services['category_name'].unique())\n",
    "print(aws_categories)\n",
    "print()\n",
    "print('Azure Categories')\n",
    "azure_categories = list(azure_services['category_name'].unique())\n",
    "print(azure_categories)\n",
    "print()\n",
    "print('Google Cloud Categories')\n",
    "google_categories = list(google_services['category_name'].unique())\n",
    "print(google_categories)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Resolve similar categories for AWS and Azure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 181,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'Analytics': 'Analytics',\n",
       " 'Integration': 'Application Integration',\n",
       " 'Application Integration': 'Application Integration',\n",
       " 'Compute': 'Compute',\n",
       " 'Databases': 'Databases',\n",
       " 'Database': 'Databases',\n",
       " 'Developer Tools': 'Developer Tools',\n",
       " 'Internet of Things': 'Internet of Things',\n",
       " 'AI + Machine Learning': 'AI + Machine Learning',\n",
       " 'Machine Learning': 'AI + Machine Learning',\n",
       " 'Media': 'Media Services',\n",
       " 'Media Services': 'Media Services',\n",
       " 'Migration': 'Migration & Transfer',\n",
       " 'Migration & Transfer': 'Migration & Transfer',\n",
       " 'Mobile': 'Mobile',\n",
       " 'Networking': 'Networking & Content Delivery',\n",
       " 'Networking & Content Delivery': 'Networking & Content Delivery',\n",
       " 'Identity': 'Security, Identity & Compliance',\n",
       " 'Security, Identity & Compliance': 'Security, Identity & Compliance',\n",
       " 'Security': 'Security, Identity & Compliance',\n",
       " 'Storage': 'Storage'}"
      ]
     },
     "execution_count": 181,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "normalized_cats = {}\n",
    "for aws_cat in aws_categories:\n",
    "    for azure_cat in azure_categories:\n",
    "        if fuzz.ratio(aws_cat, azure_cat) > 75 or aws_cat in azure_cat or azure_cat in aws_cat:\n",
    "            if len(aws_cat) < len(azure_cat):\n",
    "                norm = azure_cat\n",
    "            else:\n",
    "                norm = aws_cat\n",
    "\n",
    "            normalized_cats[azure_cat] = norm\n",
    "            normalized_cats[aws_cat] = norm\n",
    "\n",
    "normalized_cats"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Resolve similar categories between Google categories and the normalized AWS/Azure categories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Compute Compute\n",
      "Databases Databases\n",
      "Storage Storage\n",
      "Migration Migration & Transfer\n",
      "Networking Networking & Content Delivery\n",
      "Developer tools Developer Tools\n",
      "Data analytics Analytics\n",
      "AI and machine learning AI + Machine Learning\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'Analytics': 'Analytics',\n",
       " 'Integration': 'Application Integration',\n",
       " 'Application Integration': 'Application Integration',\n",
       " 'Compute': 'Compute',\n",
       " 'Databases': 'Databases',\n",
       " 'Database': 'Databases',\n",
       " 'Developer Tools': 'Developer Tools',\n",
       " 'Internet of Things': 'Internet of Things',\n",
       " 'AI + Machine Learning': 'AI + Machine Learning',\n",
       " 'Machine Learning': 'AI + Machine Learning',\n",
       " 'Media': 'Media Services',\n",
       " 'Media Services': 'Media Services',\n",
       " 'Migration': 'Migration & Transfer',\n",
       " 'Migration & Transfer': 'Migration & Transfer',\n",
       " 'Mobile': 'Mobile',\n",
       " 'Networking': 'Networking & Content Delivery',\n",
       " 'Networking & Content Delivery': 'Networking & Content Delivery',\n",
       " 'Identity': 'Security, Identity & Compliance',\n",
       " 'Security, Identity & Compliance': 'Security, Identity & Compliance',\n",
       " 'Security': 'Security, Identity & Compliance',\n",
       " 'Storage': 'Storage',\n",
       " 'Developer tools': 'Developer Tools',\n",
       " 'AI and machine learning': 'AI + Machine Learning',\n",
       " 'Data analytics': 'Analytics'}"
      ]
     },
     "execution_count": 199,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "for google_cat in google_categories:\n",
    "    for norm_cat in set(normalized_cats.values()):\n",
    "        if fuzz.ratio(google_cat, norm_cat) > 60 or google_cat in norm_cat or norm_cat in google_cat:\n",
    "            print(google_cat, norm_cat)\n",
    "            normalized_cats[google_cat] = norm_cat\n",
    "            \n",
    "normalized_cats"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "AWS Categories\n",
      "['Analytics', 'Application Integration', 'AR & VR', 'AWS Cost Management', 'Blockchain', 'Business Applications', 'Compute', 'Customer Engagement', 'Database', 'Desktop & App Streaming', 'Developer Tools', 'Game Tech', 'Internet of Things', 'Machine Learning', 'Management & Governance', 'Media Services', 'Migration & Transfer', 'Mobile', 'Networking & Content Delivery', 'Robotics', 'Satellite', 'Security, Identity & Compliance', 'Storage']\n",
      "\n",
      "Azure Categories\n",
      "['Compute', 'Networking', 'Storage', 'Web', 'Mobile', 'Containers', 'Databases', 'Analytics', 'AI + Machine Learning', 'Internet of Things', 'Integration', 'Identity', 'Security', 'DevOps', 'Developer Tools', 'Management Tools', 'Media', 'Migration', 'Azure Stack', 'Sovereign Clouds']\n",
      "\n",
      "Google Cloud Categories\n",
      "['Compute', 'Databases', 'Management tools', 'Apigee API Platform', 'Storage', 'Migration', 'Networking', 'Developer tools', 'Cloud IoT Core', 'Anvato', 'Data analytics', 'AI and machine learning', 'Cloud IAM', 'VPC Service Controls', 'Gmail', 'Admin', 'Docs', 'Drive', 'Maps', 'Ridesharing', 'Jamboard', 'Chrome Enterprise', 'Consulting', 'Technical Account Management']\n"
     ]
    }
   ],
   "source": [
    "print('AWS Categories')\n",
    "aws_categories = list(aws_services['category_name'].unique())\n",
    "print(aws_categories)\n",
    "print()\n",
    "print('Azure Categories')\n",
    "azure_categories = list(azure_services['category_name'].unique())\n",
    "print(azure_categories)\n",
    "print()\n",
    "print('Google Cloud Categories')\n",
    "google_categories = list(google_services['category_name'].unique())\n",
    "print(google_categories)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Let's pick up a couple obvious strays from Google"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "metadata": {},
   "outputs": [],
   "source": [
    "normalized_cats['Cloud IAM'] = normalized_cats['Identity']\n",
    "normalized_cats['Cloud IOT Core'] = normalized_cats['Internet of Things']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add the normalized categories as super categories.\n",
    "These super categories will begin to connect the services from the different cloud providers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "metadata": {},
   "outputs": [],
   "source": [
    "for text, norm in normalized_cats.items():\n",
    "    category_res = gremlin_qm.query(f\"g.V().has('name', '{norm}').has('label', 'category')\")\n",
    "    if category_res:\n",
    "        norm_category_id = category_res[0]['id']\n",
    "    else:\n",
    "        vq = GremlinQueryBuilder.build_upsert_vertex_query('category', {'name': norm})\n",
    "        norm_category_id = gremlin_qm.query(vq)[0]['id']\n",
    "\n",
    "    nodes = gremlin_qm.query(f\"g.V().has('name', '{text}')\")\n",
    "    for node in nodes:        \n",
    "        eq = GremlinQueryBuilder.build_upsert_edge_query(node['id'], norm_category_id, {'label': 'super_category'})\n",
    "        gremlin_qm.query(eq)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
