{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import pandas as pd\n",
    "from pathlib import Path\n",
    "import requests\n",
    "from dotenv import load_dotenv, find_dotenv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from src.data.cosmos import GremlinQueryManager, DocumentQueryManager\n",
    "from src.data.graph.gremlin import GremlinQueryBuilder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv(find_dotenv())\n",
    "\n",
    "account_name = os.environ.get('COSMOS_ACCOUNT_NAME')\n",
    "db_name = os.environ.get('COSMOS_DB_NAME')\n",
    "graph_name = os.environ.get('COSMOS_GRAPH_NAME')\n",
    "master_key = os.environ.get('COSMOS_MASTER_KEY')\n",
    "search_key = os.environ.get('AZURE_SEARCH_KEY')\n",
    "search_account_name = os.environ.get('ACCOUNT_NAME')\n",
    "\n",
    "gremlin_qm = GremlinQueryManager(account_name, master_key, db_name, graph_name)\n",
    "doc_qm = DocumentQueryManager(account_name, master_key, db_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 171,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "475"
      ]
     },
     "execution_count": 171,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "services_data = []\n",
    "\n",
    "abbrs = gremlin_qm.query('g.V().has(\"label\", \"cloud\").values(\"abbreviation\")')\n",
    "for abbr in abbrs:\n",
    "# abbr = 'azure'\n",
    "    q = f\"\"\"g.V().has(\"label\", \"{abbr}_service\")\n",
    "            .project(\"id\", \"name\", \"shortDescription\", \"longDescription\", \"uri\", \"iconUri\", \"categories\", \"relatedServices\", \"cloud\")\n",
    "            .by(\"id\").by(\"name\").by(\"short_description\").by(\"long_description\").by(\"uri\").by(\"icon_uri\")\n",
    "            .by(out(\"belongs_to\").values(\"name\").fold())\n",
    "            .by(coalesce(out(\"related_service\").id().fold(), __.not(identity()).fold()))\n",
    "            .by(out(\"belongs_to\").out(\"source_cloud\").values(\"name\"))\"\"\"\n",
    "    cloud_data = gremlin_qm.query(q)\n",
    "    services_data += cloud_data\n",
    "    \n",
    "len(services_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 172,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 'ad77902d-10f7-4d3e-971c-8b734a059076',\n",
       "  'name': 'AWS Lambda',\n",
       "  'shortDescription': 'Run your Code in Response to Events',\n",
       "  'longDescription': 'AWS Lambda lets you run code without provisioning or managing servers. You pay only for the compute time you consume - there is no charge when your code is not running. \\nWith Lambda, you can run code for virtually any type of application or backend service - all with zero administration. Just upload your code and Lambda takes care of everything required to run and scale your code with high availability. You can set up your code to automatically trigger from other AWS services or call it directly from any web or mobile app. \\nAWS Lambda automatically runs your code without requiring you to provision or manage servers. Just write the code and upload it to Lambda.',\n",
       "  'uri': 'https://aws.amazon.com/lambda/?c=7&pt=10',\n",
       "  'iconUri': '',\n",
       "  'categories': ['Compute'],\n",
       "  'relatedServices': ['a8450c27-4ed7-45a3-8e08-55ef67910fc3'],\n",
       "  'cloud': 'Amazon Web Services'}]"
      ]
     },
     "execution_count": 172,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "[s for s in services_data if s['name'] == 'AWS Lambda']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 173,
   "metadata": {},
   "outputs": [],
   "source": [
    "class AzureSearchClient:\n",
    "    def __init__(self, account_name, api_key):\n",
    "        self.account_name = account_name\n",
    "        self.api_key = api_key\n",
    "        self.default_headers = {\n",
    "            'api-key': api_key\n",
    "        }\n",
    "        \n",
    "    def run_search(search_term):\n",
    "        search_url = f'https://{self.account_name}.search.windows.net/indexes/services-v0/docs/autocomplete'\n",
    "        params = {\n",
    "            'api-version': '2017-11-11-preview',\n",
    "            'search': search_term,\n",
    "            '$top': 3,\n",
    "            'scoringProfile': 'boostName',\n",
    "            'autocompleteMode': 'twoTerms'\n",
    "        }\n",
    "        \n",
    "        res = requests.get(search_url, headers=self.default_headers, params=params)\n",
    "        return res\n",
    "        \n",
    "    def upsert_index(self, index_name, fields_config, suggesters, scoring_profiles):\n",
    "        kwargs = {\n",
    "            'headers': self.default_headers,\n",
    "            'json': {\n",
    "                'name': index_name,\n",
    "                'fields': fields_config,\n",
    "                'suggesters': suggesters,\n",
    "                'scoringProfiles': scoring_profiles\n",
    "            }\n",
    "        }\n",
    "        delete_res = requests.delete(f\"https://{self.account_name}.search.windows.net/indexes/{index_name}?api-version=2017-11-11\", **kwargs)\n",
    "        res = requests.post(\n",
    "            f\"https://{self.account_name}.search.windows.net/indexes/?api-version=2017-11-11\",\n",
    "            **kwargs\n",
    "        )\n",
    "        return res\n",
    "    \n",
    "    def upload_data(self, index_name, data):\n",
    "        for i in range(len(data)):\n",
    "            data[i]['@search.action'] = 'mergeOrUpload'\n",
    "        res = requests.post(\n",
    "            f\"https://{self.account_name}.search.windows.net/indexes/{index_name}/docs/index?api-version=2017-11-11\",\n",
    "            headers=self.default_headers,\n",
    "            json={\n",
    "                'value': data\n",
    "            }\n",
    "        )\n",
    "        return res\n",
    "    \n",
    "    def upsert_synonym_map(self, name, synonyms):\n",
    "        kwargs = {\n",
    "            'headers': self.default_headers,\n",
    "            'json': {\n",
    "                'name': name,\n",
    "                'format': 'solr',\n",
    "                'synonyms': synonyms\n",
    "            }\n",
    "        }\n",
    "\n",
    "        res = requests.post(\n",
    "            f\"https://{self.account_name}.search.windows.net/synonymmaps?api-version=2017-11-11\",\n",
    "            **kwargs\n",
    "        )\n",
    "        if res.status_code > 299:\n",
    "            res = requests.put(\n",
    "                f\"https://{self.account_name}.search.windows.net/synonymmaps/{name}?api-version=2017-11-11\",\n",
    "                **kwargs\n",
    "            )\n",
    "            \n",
    "        return res\n",
    "        \n",
    "    \n",
    "search_client = AzureSearchClient(search_account_name, search_key)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 149,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "''"
      ]
     },
     "execution_count": 149,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "azure_synonyms = \"\"\"\n",
    "AD, Active Directory, AAD\\n\n",
    "AKS, Azure Kubernetes Service\\n,\n",
    "function, functions\n",
    "database, databases\n",
    "\"\"\"\n",
    "search_client.upsert_synonym_map('azure-service-abbreviations', azure_synonyms).text"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 174,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "deleted 204\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<Response [201]>"
      ]
     },
     "execution_count": 174,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "services_v0_field_config = [\n",
    "    {\"name\": \"id\", \"type\": \"Edm.String\", \"key\": True, \"searchable\": False, \"sortable\": False, \"facetable\": False},\n",
    "    {\"name\": \"name\", \"type\": \"Edm.String\", \"synonymMaps\":[\"azure-service-abbreviations\"]},\n",
    "    {\"name\": \"shortDescription\", \"type\": \"Edm.String\", \"filterable\": False, \"sortable\": False, \"facetable\": False},\n",
    "    {\"name\": \"longDescription\", \"type\": \"Edm.String\", \"filterable\": False, \"sortable\": False, \"facetable\": False},\n",
    "    {\"name\": \"uri\", \"type\": \"Edm.String\", \"facetable\": False},\n",
    "    {\"name\": \"iconUri\", \"type\": \"Edm.String\", \"facetable\": False},\n",
    "    {\"name\": \"categories\", \"type\": \"Collection(Edm.String)\"},\n",
    "    {\"name\": \"relatedServices\", \"type\": \"Collection(Edm.String)\", \"searchable\": False, \"filterable\": False, \"sortable\": False, \"facetable\": False},\n",
    "    {\"name\": \"cloud\", \"type\": \"Edm.String\", \"searchable\": False, \"sortable\": False}\n",
    "]\n",
    "\n",
    "suggesters = [  \n",
    "    {  \n",
    "        \"name\": \"suggest-name\",  \n",
    "        \"searchMode\": \"analyzingInfixMatching\",  \n",
    "        \"sourceFields\": [\"name\"]\n",
    "    }  \n",
    "]\n",
    "\n",
    "scoring_profiles = [  \n",
    "    {  \n",
    "      \"name\": \"boostName\",  \n",
    "      \"text\": {  \n",
    "        \"weights\": {  \n",
    "          \"name\": 3          \n",
    "        }  \n",
    "      }  \n",
    "    }\n",
    "]\n",
    "\n",
    "r = search_client.upsert_index(\n",
    "    'services-v0', services_v0_field_config, suggesters, scoring_profiles\n",
    ")\n",
    "r"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 175,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "200"
      ]
     },
     "execution_count": 175,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "upload_res = search_client.upload_data('services-v0', services_data)\n",
    "upload_res.status_code"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': '1a629f6c-8ca7-43f2-8eb6-76eecd7fe0cf',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '54f59ebf-5a0a-4824-9841-10de80679f2f',\n",
       "     'value': 'Analytics'}]}},\n",
       " {'id': 'fb88345e-f6ea-4508-a191-3c03563b96b0',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '368b14a5-dd14-428c-8dda-c83424ded5e1',\n",
       "     'value': 'Application Integration'}]}},\n",
       " {'id': 'bf2f3feb-82e9-411b-92e5-04df21599a39',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '00a1890d-2057-49e0-b110-ad1c5ae7b341',\n",
       "     'value': 'AR & VR'}]}},\n",
       " {'id': 'c4a12b19-c1b7-4e48-9c15-5785e363b4bd',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '91d95bfd-29af-4713-a9ff-03322ae12094',\n",
       "     'value': 'AWS Cost Management'}]}},\n",
       " {'id': 'f6a2df1a-a3a6-427e-848d-ff325c49957f',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '55974085-532c-4ce8-96dc-5c7cb7fce324',\n",
       "     'value': 'Blockchain'}]}},\n",
       " {'id': '7cbeeab2-1ad3-4e98-a0fa-56dcd37b219c',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': 'd8623492-ea5b-4528-925e-1308f3762aa7',\n",
       "     'value': 'Business Applications'}]}},\n",
       " {'id': '1e782738-935b-4bf7-b35f-36a11e31f215',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '7a183188-065e-4420-b7c4-8576ae7d2238',\n",
       "     'value': 'Compute'}]}},\n",
       " {'id': 'cbddc303-302b-4c6c-b565-afc60ca46ba0',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '9a3c36b2-c1bc-43b8-ac2d-b2eda8e65932',\n",
       "     'value': 'Customer Engagement'}]}},\n",
       " {'id': '6963d9c0-3670-443f-a639-7fdb840466d6',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': 'b490bd4e-0797-410a-824b-9a29dbcf6fd3',\n",
       "     'value': 'Database'}]}},\n",
       " {'id': '0123d6f1-e92c-46f5-944c-030dda796d6d',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '3b724c14-ed3b-4bcd-a760-5ac6686f6634',\n",
       "     'value': 'Developer Tools'}]}},\n",
       " {'id': '12e57bde-703e-4dfc-ba12-d5d4262039a6',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '46345cee-1a74-498f-8020-8c9d3f4aaff0',\n",
       "     'value': 'End User Computing'}]}},\n",
       " {'id': 'b586b167-f828-4455-a9e7-6477d0b5527e',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '63332431-da27-440d-bf0a-9eaa84a9ffd3',\n",
       "     'value': 'Game Tech'}]}},\n",
       " {'id': 'f1261502-4ad1-455f-b667-13e027ffefc4',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '6ff823d6-467f-49d4-a785-c61794973a2e',\n",
       "     'value': 'Internet of Things'}]}},\n",
       " {'id': '08f7173a-52d0-46ed-8961-da344b1cdb78',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': 'a2550921-2a90-412e-ba11-4a3f5e940e57',\n",
       "     'value': 'Machine Learning'}]}},\n",
       " {'id': '8fbdf77e-42cf-44e0-986d-4dc20c6c14b2',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': 'e5c271c8-94d8-4760-92f2-c33df4138e16',\n",
       "     'value': 'Management & Governance'}]}},\n",
       " {'id': '988cc64b-eac3-498e-aa71-ee73c8e994c2',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': 'a88ae746-ecce-43de-b00a-8dd4587461f7',\n",
       "     'value': 'Media Services'}]}},\n",
       " {'id': '32972297-6ed4-4019-9b66-ae99f6294a11',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '9f989c4b-5275-4870-a5ba-cf7eea19aa1d',\n",
       "     'value': 'Migration & Transfer'}]}},\n",
       " {'id': 'b30a9071-1b2a-4b98-9bda-7d1275c548e7',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': 'c3dffdba-3a40-4531-9cb0-fffe77e8aa65',\n",
       "     'value': 'Mobile'}]}},\n",
       " {'id': '48f7cb12-2b35-46e9-9926-7a081927c743',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '7cf4b440-2ec8-4d01-8a2c-f4ea070f44f4',\n",
       "     'value': 'Networking & Content Delivery'}]}},\n",
       " {'id': 'e200cb65-d0e0-4ace-a2b8-293785783341',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '1ae8e646-7b7f-4ce0-aae9-efee9c8e2ee9',\n",
       "     'value': 'Robotics'}]}},\n",
       " {'id': '35d01fd2-e933-48c6-9cf4-013d1931daa3',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': 'd1f3cf17-2ac9-46c2-8d68-a57d12b1e991',\n",
       "     'value': 'Satellite'}]}},\n",
       " {'id': '7af96f8a-9f00-40da-b088-d8ee7f3dd8f7',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '1df59a2f-c71c-4a8e-8485-9d874c79f864',\n",
       "     'value': 'Security, Identity & Compliance'}]}},\n",
       " {'id': '02c19c24-98da-459f-ac0b-d6646aa04394',\n",
       "  'label': 'aws_category',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '7f73619f-28bd-45ca-9c58-de015702b456',\n",
       "     'value': 'Storage'}]}}]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gremlin_qm.query('g.V(\"7397ee26-10f0-40a7-9e9f-393a53686e42\").in(\"source_cloud\")')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adding related_service edges between Amazon Elastic Container Service and Azure Container Instances\n",
      "Adding related_service edges between AWS Batch and Azure Batch\n",
      "Adding related_service edges between Azure Kubernetes Service (AKS) and Amazon Elastic Container Service for Kubernetes\n",
      "Adding related_service edges between Amazon Cloud Directory and Azure Active Directory\n",
      "Adding related_service edges between Amazon API Gateway and Azure Application Gateway\n",
      "Adding related_service edges between Azure Database Migration Service and AWS Database Migration Service\n",
      "Adding related_service edges between Azure IoT Central and AWS IoT Analytics\n",
      "Adding related_service edges between AWS Key Management Service and Azure Key Vault\n",
      "Adding related_service edges between Amazon Aurora and Azure SQL Database\n",
      "Adding related_service edges between Azure IoT Hub Device Provisioning Service and AWS IoT Device Management\n",
      "Adding related_service edges between AWS IoT Core and Azure IoT Hub\n",
      "Adding related_service edges between Azure SDKs and AWS Tools and SDKs\n",
      "Adding related_service edges between AWS Lambda and Azure Functions\n",
      "Adding related_service edges between Azure File Storage and Amazon FSx for Windows File Server\n",
      "Adding related_service edges between Amazon CloudFront and Azure Content Delivery Network\n",
      "Adding related_service edges between Amazon Simple Storage Service (S3) and Azure Storage\n",
      "Adding related_service edges between Azure ExpressRoute and AWS Direct Connect\n",
      "Adding related_service edges between AWS Lake Formation and Azure Data Lake Analytics\n",
      "Adding related_service edges between Azure Data Box family and AWS Snow Family\n",
      "Adding related_service edges between Azure Machine Learning Services and Amazon SageMaker\n",
      "Adding related_service edges between AWS IoT Things Graph and Azure IoT Fundamentals\n",
      "Adding related_service edges between Azure Log Analytics and Amazon CloudSearch\n",
      "Adding related_service edges between Azure StorSimple and AWS Storage Gateway\n",
      "Adding related_service edges between AWS Directory Service and Azure Active Directory B2C\n",
      "Adding related_service edges between Azure Database for MySQL and Amazon RDS\n",
      "Adding related_service edges between AWS Elastic Beanstalk and Azure App Service\n",
      "Adding related_service edges between Amazon DynamoDB and Azure Table Storage\n",
      "Adding related_service edges between AWS Global Accelerator and Azure Traffic Manager\n",
      "Adding related_service edges between AWS Identity & Access Management and Azure Role-based access control\n"
     ]
    }
   ],
   "source": [
    "aws_azure_df = pd.read_csv('../data/processed/aws_azure_data_matching_output.csv')\n",
    "aws_azure_related = aws_azure_df[aws_azure_df['Link Score'] > 0.6].sort_values(['Cluster ID'])\n",
    "\n",
    "def get_svc_id(gremlin_qm, svc_name):\n",
    "    q = f'g.V().has(\"name\", \"{svc_name}\").values(\"id\")'\n",
    "    res = gremlin_qm.query(q)\n",
    "    return res[0]\n",
    "\n",
    "def build_related_query(from_id, to_id):\n",
    "    return GremlinQueryBuilder.build_upsert_edge_query(from_id, to_id, {\n",
    "        'label': 'related_service', 'related_service_score': aws_svc['Link Score']\n",
    "    })\n",
    "\n",
    "for i in range(list(aws_azure_related['Cluster ID'])[-1] + 1):\n",
    "    related_services = aws_azure_related[aws_azure_related['Cluster ID'] == i].reset_index(drop=True)\n",
    "    aws_svc = related_services.iloc[0]\n",
    "    azure_svc = related_services.iloc[1]\n",
    "    \n",
    "    aws_id = get_svc_id(gremlin_qm, aws_svc['name'])\n",
    "    azure_id = get_svc_id(gremlin_qm, azure_svc['name'])\n",
    "    \n",
    "    print(f'Adding related_service edges between {aws_svc[\"name\"]} and {azure_svc[\"name\"]}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Cluster ID</th>\n",
       "      <th>Link Score</th>\n",
       "      <th>source file</th>\n",
       "      <th>category_name</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "      <th>long_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>0</td>\n",
       "      <td>0.996641</td>\n",
       "      <td>0</td>\n",
       "      <td>Compute</td>\n",
       "      <td>Amazon Elastic Container Service</td>\n",
       "      <td>Run and Manage Docker Containers</td>\n",
       "      <td>Amazon Elastic Container Service (Amazon ECS) ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>181</th>\n",
       "      <td>0</td>\n",
       "      <td>0.996641</td>\n",
       "      <td>1</td>\n",
       "      <td>Compute</td>\n",
       "      <td>Azure Container Instances</td>\n",
       "      <td>Easily run containers with a single command</td>\n",
       "      <td>Azure Container Instances offers the fastest a...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>1</td>\n",
       "      <td>0.993355</td>\n",
       "      <td>0</td>\n",
       "      <td>Compute</td>\n",
       "      <td>AWS Batch</td>\n",
       "      <td>Run Batch Jobs at Any Scale</td>\n",
       "      <td>AWS Batch enables developers, scientists, and ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>180</th>\n",
       "      <td>1</td>\n",
       "      <td>0.993355</td>\n",
       "      <td>1</td>\n",
       "      <td>Compute</td>\n",
       "      <td>Azure Batch</td>\n",
       "      <td>Cloud-scale job scheduling and compute management</td>\n",
       "      <td>Use Batch to run large-scale parallel and high...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>184</th>\n",
       "      <td>2</td>\n",
       "      <td>0.990656</td>\n",
       "      <td>1</td>\n",
       "      <td>Compute</td>\n",
       "      <td>Azure Kubernetes Service (AKS)</td>\n",
       "      <td>Simplify the deployment, management, and opera...</td>\n",
       "      <td>Azure Kubernetes Service (AKS) manages your ho...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Cluster ID  Link Score  source file category_name  \\\n",
       "28            0    0.996641            0       Compute   \n",
       "181           0    0.996641            1       Compute   \n",
       "32            1    0.993355            0       Compute   \n",
       "180           1    0.993355            1       Compute   \n",
       "184           2    0.990656            1       Compute   \n",
       "\n",
       "                                 name  \\\n",
       "28   Amazon Elastic Container Service   \n",
       "181         Azure Container Instances   \n",
       "32                          AWS Batch   \n",
       "180                       Azure Batch   \n",
       "184    Azure Kubernetes Service (AKS)   \n",
       "\n",
       "                                     short_description  \\\n",
       "28                    Run and Manage Docker Containers   \n",
       "181        Easily run containers with a single command   \n",
       "32                         Run Batch Jobs at Any Scale   \n",
       "180  Cloud-scale job scheduling and compute management   \n",
       "184  Simplify the deployment, management, and opera...   \n",
       "\n",
       "                                      long_description  \n",
       "28   Amazon Elastic Container Service (Amazon ECS) ...  \n",
       "181  Azure Container Instances offers the fastest a...  \n",
       "32   AWS Batch enables developers, scientists, and ...  \n",
       "180  Use Batch to run large-scale parallel and high...  \n",
       "184  Azure Kubernetes Service (AKS) manages your ho...  "
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "aws_azure_related.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Cluster ID</th>\n",
       "      <th>Link Score</th>\n",
       "      <th>source file</th>\n",
       "      <th>category_name</th>\n",
       "      <th>name</th>\n",
       "      <th>short_description</th>\n",
       "      <th>long_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0</td>\n",
       "      <td>0.993781</td>\n",
       "      <td>0</td>\n",
       "      <td>Compute</td>\n",
       "      <td>Azure Functions</td>\n",
       "      <td>Process events with serverless code</td>\n",
       "      <td>Azure Functions is a serverless compute servic...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>179</th>\n",
       "      <td>0</td>\n",
       "      <td>0.993781</td>\n",
       "      <td>1</td>\n",
       "      <td>Compute</td>\n",
       "      <td>Cloud Functions</td>\n",
       "      <td>Event-driven serverless compute platform.</td>\n",
       "      <td>Google Cloud Functions makes it easy for devel...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>248</th>\n",
       "      <td>1</td>\n",
       "      <td>0.988334</td>\n",
       "      <td>1</td>\n",
       "      <td>Networking &amp; Content Delivery</td>\n",
       "      <td>Cloud DNS</td>\n",
       "      <td>Reliable, resilient, low-latency DNS serving.</td>\n",
       "      <td>Reliable, low-latency, authoritative DNS servi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>1</td>\n",
       "      <td>0.988334</td>\n",
       "      <td>0</td>\n",
       "      <td>Networking &amp; Content Delivery</td>\n",
       "      <td>Azure DNS</td>\n",
       "      <td>Host your DNS domain in Azure</td>\n",
       "      <td>Learn how to use Azure DNS. Quickstarts, tutor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>157</th>\n",
       "      <td>2</td>\n",
       "      <td>0.972491</td>\n",
       "      <td>1</td>\n",
       "      <td>AI + Machine Learning</td>\n",
       "      <td>Cloud Machine Learning Engine</td>\n",
       "      <td>Build superior models and deploy them into pro...</td>\n",
       "      <td>Create your predictive analytics and machine l...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>2</td>\n",
       "      <td>0.972491</td>\n",
       "      <td>0</td>\n",
       "      <td>AI + Machine Learning</td>\n",
       "      <td>Azure Machine Learning Services</td>\n",
       "      <td>Build, deploy, and manage machine learning and...</td>\n",
       "      <td>Learn how to build intelligent algorithms into...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>130</th>\n",
       "      <td>3</td>\n",
       "      <td>0.963271</td>\n",
       "      <td>0</td>\n",
       "      <td>Management Tools</td>\n",
       "      <td>Azure Cost Management</td>\n",
       "      <td>Optimize what you spend on the cloud, while ma...</td>\n",
       "      <td>Azure Cost Management is a cost management sol...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>231</th>\n",
       "      <td>3</td>\n",
       "      <td>0.963271</td>\n",
       "      <td>1</td>\n",
       "      <td>Management tools</td>\n",
       "      <td>Cost management</td>\n",
       "      <td>Tools for monitoring, controlling, and optimiz...</td>\n",
       "      <td>Increase cost predictability. Gain greater vis...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>229</th>\n",
       "      <td>4</td>\n",
       "      <td>0.960669</td>\n",
       "      <td>1</td>\n",
       "      <td>Management tools</td>\n",
       "      <td>Cloud Shell</td>\n",
       "      <td>Command-line management from any browser.</td>\n",
       "      <td>Google Cloud Shell is a free admin machine wit...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>126</th>\n",
       "      <td>4</td>\n",
       "      <td>0.960669</td>\n",
       "      <td>0</td>\n",
       "      <td>Management Tools</td>\n",
       "      <td>Azure Cloud Shell</td>\n",
       "      <td>Streamline Azure administration with a browser...</td>\n",
       "      <td>Azure Cloud Shell is an interactive, browser-a...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Cluster ID  Link Score  source file                  category_name  \\\n",
       "3             0    0.993781            0                        Compute   \n",
       "179           0    0.993781            1                        Compute   \n",
       "248           1    0.988334            1  Networking & Content Delivery   \n",
       "16            1    0.988334            0  Networking & Content Delivery   \n",
       "157           2    0.972491            1          AI + Machine Learning   \n",
       "79            2    0.972491            0          AI + Machine Learning   \n",
       "130           3    0.963271            0               Management Tools   \n",
       "231           3    0.963271            1               Management tools   \n",
       "229           4    0.960669            1               Management tools   \n",
       "126           4    0.960669            0               Management Tools   \n",
       "\n",
       "                                name  \\\n",
       "3                    Azure Functions   \n",
       "179                  Cloud Functions   \n",
       "248                        Cloud DNS   \n",
       "16                         Azure DNS   \n",
       "157    Cloud Machine Learning Engine   \n",
       "79   Azure Machine Learning Services   \n",
       "130            Azure Cost Management   \n",
       "231                  Cost management   \n",
       "229                      Cloud Shell   \n",
       "126                Azure Cloud Shell   \n",
       "\n",
       "                                     short_description  \\\n",
       "3                  Process events with serverless code   \n",
       "179          Event-driven serverless compute platform.   \n",
       "248      Reliable, resilient, low-latency DNS serving.   \n",
       "16                       Host your DNS domain in Azure   \n",
       "157  Build superior models and deploy them into pro...   \n",
       "79   Build, deploy, and manage machine learning and...   \n",
       "130  Optimize what you spend on the cloud, while ma...   \n",
       "231  Tools for monitoring, controlling, and optimiz...   \n",
       "229          Command-line management from any browser.   \n",
       "126  Streamline Azure administration with a browser...   \n",
       "\n",
       "                                      long_description  \n",
       "3    Azure Functions is a serverless compute servic...  \n",
       "179  Google Cloud Functions makes it easy for devel...  \n",
       "248  Reliable, low-latency, authoritative DNS servi...  \n",
       "16   Learn how to use Azure DNS. Quickstarts, tutor...  \n",
       "157  Create your predictive analytics and machine l...  \n",
       "79   Learn how to build intelligent algorithms into...  \n",
       "130  Azure Cost Management is a cost management sol...  \n",
       "231  Increase cost predictability. Gain greater vis...  \n",
       "229  Google Cloud Shell is a free admin machine wit...  \n",
       "126  Azure Cloud Shell is an interactive, browser-a...  "
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "azure_gcp_df = pd.read_csv('../data/processed/azure_gcp_data_matching_output.csv')\n",
    "azure_gcp_related = azure_gcp_df[azure_gcp_df['Link Score'] > 0.6].sort_values(['Cluster ID'])\n",
    "\n",
    "def get_svc_id(gremlin_qm, svc_name):\n",
    "    q = f'g.V().has(\"name\", \"{svc_name}\").values(\"id\")'\n",
    "    return gremlin_qm.query(q)[0]\n",
    "\n",
    "def build_related_query(from_id, to_id, score):\n",
    "    return GremlinQueryBuilder.build_upsert_edge_query(from_id, to_id, {\n",
    "        'label': 'related_service', 'related_service_score': score\n",
    "    })\n",
    "\n",
    "azure_gcp_related.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adding related_service edges between Azure Functions and Cloud Functions\n",
      "Adding related_service edges between Azure DNS and Cloud DNS\n",
      "Adding related_service edges between Azure Machine Learning Services and Cloud Machine Learning Engine\n",
      "Adding related_service edges between Azure Cost Management and Cost management\n",
      "Adding related_service edges between Azure Cloud Shell and Cloud Shell\n",
      "Adding related_service edges between Azure Dedicated HSM and Cloud HSM\n",
      "Adding related_service edges between Azure Visual Studio and Cloud Tools for Visual Studio\n",
      "Adding related_service edges between Azure Key Vault and Cloud Key Management Service\n",
      "Adding related_service edges between Azure Resource Manager and Cloud Deployment Manager\n",
      "Adding related_service edges between Azure Security Center and Cloud Security Command Center (beta)\n",
      "Adding related_service edges between Azure App Service and App Engine\n",
      "Adding related_service edges between Azure VPN Gateway and Cloud VPN\n",
      "Adding related_service edges between Azure HDInsight and Cloud Dataproc\n",
      "Adding related_service edges between Azure Disk Storage and Persistent Disk\n",
      "Adding related_service edges between Azure SQL Server on Virtual Machines and Cloud SQL\n",
      "Adding related_service edges between Azure Container Instances and Container security\n",
      "Adding related_service edges between Azure Network Watcher and Network Service Tiers\n",
      "Adding related_service edges between Azure Content Delivery Network and Cloud CDN\n",
      "Adding related_service edges between Azure SQL Database and Cloud Spanner\n"
     ]
    }
   ],
   "source": [
    "def update_related_services(prodigy_data_matching_output_df):\n",
    "    for i in range(list(prodigy_data_matching_output_df['Cluster ID'])[-1] + 1):\n",
    "        \n",
    "        related_services = prodigy_data_matching_output_df[prodigy_data_matching_output_df['Cluster ID'] == i].reset_index(drop=True)\n",
    "        left_svc = related_services[related_services['source file'] == 0].iloc[0]\n",
    "        right_svc = related_services[related_services['source file'] == 1].iloc[0]\n",
    "        \n",
    "        left_id = get_svc_id(gremlin_qm, left_svc['name'])\n",
    "        right_id = get_svc_id(gremlin_qm, right_svc['name'])\n",
    "\n",
    "        \n",
    "        left_related_edges = gremlin_qm.query(f\"g.V('{left_id}').outE('related_service')\")\n",
    "        for rel_svc in left_related_edges:\n",
    "            if rel_svc['inV'] != right_id:\n",
    "                score = rel_svc['properties']['related_service_score']\n",
    "\n",
    "                gremlin_qm.query(build_related_query(rel_svc['inV'], right_id, score))\n",
    "                gremlin_qm.query(build_related_query(right_id, rel_svc['inV'], score))\n",
    "        \n",
    "        print(f'Adding related_service edges between {left_svc[\"name\"]} and {right_svc[\"name\"]}')\n",
    "        gremlin_qm.query(build_related_query(left_id, right_id, left_svc['Link Score']))\n",
    "        gremlin_qm.query(build_related_query(right_id, left_id, left_svc['Link Score']))\n",
    "\n",
    "update_related_services(azure_gcp_related)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
